Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCCON2_ADCDIV_Pos              _U_(0)                                               /**< (ADCHS_ADCCON2) Shared ADC Clock Divider bits Position */
#define ADCHS_ADCCON2_ADCDIV_Msk              (_U_(0x7F) << ADCHS_ADCCON2_ADCDIV_Pos)              /**< (ADCHS_ADCCON2) Shared ADC Clock Divider bits Mask */
#define ADCHS_ADCCON2_ADCDIV(value)           (ADCHS_ADCCON2_ADCDIV_Msk & ((value) << ADCHS_ADCCON2_ADCDIV_Pos))
#define ADCHS_ADCCON2_ADCEIS_Pos              _U_(8)                                               /**< (ADCHS_ADCCON2) Shared ADC Early Interrupt Select bits Position */
#define ADCHS_ADCCON2_ADCEIS_Msk              (_U_(0x7) << ADCHS_ADCCON2_ADCEIS_Pos)               /**< (ADCHS_ADCCON2) Shared ADC Early Interrupt Select bits Mask */
#define ADCHS_ADCCON2_ADCEIS(value)           (ADCHS_ADCCON2_ADCEIS_Msk & ((value) << ADCHS_ADCCON2_ADCEIS_Pos))
#define   ADCHS_ADCCON2_ADCEIS_8CLKS_EARLY_Val _U_(0x7)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 8 ADC clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_7CLKS_EARLY_Val _U_(0x6)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 7 ADC clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_6CLKS_EARLY_Val _U_(0x5)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 6 ADC clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_5CLKS_EARLY_Val _U_(0x4)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 5 ADC clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_4CLKS_EARLY_Val _U_(0x3)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 4 ADC clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_3CLKS_EARLY_Val _U_(0x2)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 3 ADC clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_2CLKS_EARLY_Val _U_(0x1)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 2 ADC module clocks prior to end of conversion  */
#define   ADCHS_ADCCON2_ADCEIS_1CLKS_EARLY_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) The data ready interrupt is generated 1 ADC module clock prior to end of conversion  */
#define ADCHS_ADCCON2_ADCEIS_8CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_8CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 8 ADC clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_7CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_7CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 7 ADC clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_6CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_6CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 6 ADC clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_5CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_5CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 5 ADC clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_4CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_4CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 4 ADC clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_3CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_3CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 3 ADC clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_2CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_2CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 2 ADC module clocks prior to end of conversion Position  */
#define ADCHS_ADCCON2_ADCEIS_1CLKS_EARLY      (ADCHS_ADCCON2_ADCEIS_1CLKS_EARLY_Val << ADCHS_ADCCON2_ADCEIS_Pos) /**< (ADCHS_ADCCON2) The data ready interrupt is generated 1 ADC module clock prior to end of conversion Position  */
#define ADCHS_ADCCON2_ENXCNVRT_Pos            _U_(11)                                              /**< (ADCHS_ADCCON2)  Position */
#define ADCHS_ADCCON2_ENXCNVRT_Msk            (_U_(0x1) << ADCHS_ADCCON2_ENXCNVRT_Pos)             /**< (ADCHS_ADCCON2)  Mask */
#define ADCHS_ADCCON2_ENXCNVRT(value)         (ADCHS_ADCCON2_ENXCNVRT_Msk & ((value) << ADCHS_ADCCON2_ENXCNVRT_Pos))
#define ADCHS_ADCCON2_EOSIEN_Pos              _U_(13)                                              /**< (ADCHS_ADCCON2) End of Scan Interrupt Enable bit Position */
#define ADCHS_ADCCON2_EOSIEN_Msk              (_U_(0x1) << ADCHS_ADCCON2_EOSIEN_Pos)               /**< (ADCHS_ADCCON2) End of Scan Interrupt Enable bit Mask */
#define ADCHS_ADCCON2_EOSIEN(value)           (ADCHS_ADCCON2_EOSIEN_Msk & ((value) << ADCHS_ADCCON2_EOSIEN_Pos))
#define   ADCHS_ADCCON2_EOSIEN_EOSRDY_INT_Val _U_(0x1)                                             /**< (ADCHS_ADCCON2) Interrupt will be generated when EOSRDY bit is set  */
#define   ADCHS_ADCCON2_EOSIEN_NOEOSRDY_INT_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) No interrupt is generated when the EOSRDY bit is set  */
#define ADCHS_ADCCON2_EOSIEN_EOSRDY_INT       (ADCHS_ADCCON2_EOSIEN_EOSRDY_INT_Val << ADCHS_ADCCON2_EOSIEN_Pos) /**< (ADCHS_ADCCON2) Interrupt will be generated when EOSRDY bit is set Position  */
#define ADCHS_ADCCON2_EOSIEN_NOEOSRDY_INT     (ADCHS_ADCCON2_EOSIEN_NOEOSRDY_INT_Val << ADCHS_ADCCON2_EOSIEN_Pos) /**< (ADCHS_ADCCON2) No interrupt is generated when the EOSRDY bit is set Position  */
#define ADCHS_ADCCON2_REFFLTIEN_Pos           _U_(14)                                              /**< (ADCHS_ADCCON2) Band Gap/ Vref Voltage Fault Interrupt Enable bit Position */
#define ADCHS_ADCCON2_REFFLTIEN_Msk           (_U_(0x1) << ADCHS_ADCCON2_REFFLTIEN_Pos)            /**< (ADCHS_ADCCON2) Band Gap/ Vref Voltage Fault Interrupt Enable bit Mask */
#define ADCHS_ADCCON2_REFFLTIEN(value)        (ADCHS_ADCCON2_REFFLTIEN_Msk & ((value) << ADCHS_ADCCON2_REFFLTIEN_Pos))
#define   ADCHS_ADCCON2_REFFLTIEN_REFFLT_INT_Val _U_(0x1)                                             /**< (ADCHS_ADCCON2) Interrupt will be generated when the REFFLT bit is set  */
#define   ADCHS_ADCCON2_REFFLTIEN_NOREFFLT_INT_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) No interrupt is generated when the REFFLT bit is set  */
#define ADCHS_ADCCON2_REFFLTIEN_REFFLT_INT    (ADCHS_ADCCON2_REFFLTIEN_REFFLT_INT_Val << ADCHS_ADCCON2_REFFLTIEN_Pos) /**< (ADCHS_ADCCON2) Interrupt will be generated when the REFFLT bit is set Position  */
#define ADCHS_ADCCON2_REFFLTIEN_NOREFFLT_INT  (ADCHS_ADCCON2_REFFLTIEN_NOREFFLT_INT_Val << ADCHS_ADCCON2_REFFLTIEN_Pos) /**< (ADCHS_ADCCON2) No interrupt is generated when the REFFLT bit is set Position  */
#define ADCHS_ADCCON2_BGVRIEN_Pos             _U_(15)                                              /**< (ADCHS_ADCCON2) Band Gap/ Vref Voltage Ready Interrupt Enable bit Position */
#define ADCHS_ADCCON2_BGVRIEN_Msk             (_U_(0x1) << ADCHS_ADCCON2_BGVRIEN_Pos)              /**< (ADCHS_ADCCON2) Band Gap/ Vref Voltage Ready Interrupt Enable bit Mask */
#define ADCHS_ADCCON2_BGVRIEN(value)          (ADCHS_ADCCON2_BGVRIEN_Msk & ((value) << ADCHS_ADCCON2_BGVRIEN_Pos))
#define   ADCHS_ADCCON2_BGVRIEN_BGVRDDY_INT_Val _U_(0x1)                                             /**< (ADCHS_ADCCON2) Interrupt will be generated when the BGVRDDY bit is set  */
#define   ADCHS_ADCCON2_BGVRIEN_NOBGVRDDY_INT_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) No interrupt is generated when the BGVRRDY bit is set  */
#define ADCHS_ADCCON2_BGVRIEN_BGVRDDY_INT     (ADCHS_ADCCON2_BGVRIEN_BGVRDDY_INT_Val << ADCHS_ADCCON2_BGVRIEN_Pos) /**< (ADCHS_ADCCON2) Interrupt will be generated when the BGVRDDY bit is set Position  */
#define ADCHS_ADCCON2_BGVRIEN_NOBGVRDDY_INT   (ADCHS_ADCCON2_BGVRIEN_NOBGVRDDY_INT_Val << ADCHS_ADCCON2_BGVRIEN_Pos) /**< (ADCHS_ADCCON2) No interrupt is generated when the BGVRRDY bit is set Position  */
#define ADCHS_ADCCON2_SAMC_Pos                _U_(16)                                              /**< (ADCHS_ADCCON2) Sample Time for the Shared ADC (ADC7) bits Position */
#define ADCHS_ADCCON2_SAMC_Msk                (_U_(0x3FF) << ADCHS_ADCCON2_SAMC_Pos)               /**< (ADCHS_ADCCON2) Sample Time for the Shared ADC (ADC7) bits Mask */
#define ADCHS_ADCCON2_SAMC(value)             (ADCHS_ADCCON2_SAMC_Msk & ((value) << ADCHS_ADCCON2_SAMC_Pos))
#define ADCHS_ADCCON2_EOSRDY_Pos              _U_(29)                                              /**< (ADCHS_ADCCON2) End of Scan Interrupt Status bit Position */
#define ADCHS_ADCCON2_EOSRDY_Msk              (_U_(0x1) << ADCHS_ADCCON2_EOSRDY_Pos)               /**< (ADCHS_ADCCON2) End of Scan Interrupt Status bit Mask */
#define ADCHS_ADCCON2_EOSRDY(value)           (ADCHS_ADCCON2_EOSRDY_Msk & ((value) << ADCHS_ADCCON2_EOSRDY_Pos))
#define   ADCHS_ADCCON2_EOSRDY_SCAN_COMPLETE_Val _U_(0x1)                                             /**< (ADCHS_ADCCON2) All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning  */
#define   ADCHS_ADCCON2_EOSRDY_SCAN_NOT_COMPLETE_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) Scanning has not completed  */
#define ADCHS_ADCCON2_EOSRDY_SCAN_COMPLETE    (ADCHS_ADCCON2_EOSRDY_SCAN_COMPLETE_Val << ADCHS_ADCCON2_EOSRDY_Pos) /**< (ADCHS_ADCCON2) All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning Position  */
#define ADCHS_ADCCON2_EOSRDY_SCAN_NOT_COMPLETE (ADCHS_ADCCON2_EOSRDY_SCAN_NOT_COMPLETE_Val << ADCHS_ADCCON2_EOSRDY_Pos) /**< (ADCHS_ADCCON2) Scanning has not completed Position  */
#define ADCHS_ADCCON2_REFFLT_Pos              _U_(30)                                              /**< (ADCHS_ADCCON2) Band Gap/ Vref / AVdd BOR Fault Status bit Position */
#define ADCHS_ADCCON2_REFFLT_Msk              (_U_(0x1) << ADCHS_ADCCON2_REFFLT_Pos)               /**< (ADCHS_ADCCON2) Band Gap/ Vref / AVdd BOR Fault Status bit Mask */
#define ADCHS_ADCCON2_REFFLT(value)           (ADCHS_ADCCON2_REFFLT_Msk & ((value) << ADCHS_ADCCON2_REFFLT_Pos))
#define   ADCHS_ADCCON2_REFFLT_BG_VREF_FLT_Val _U_(0x1)                                             /**< (ADCHS_ADCCON2) Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply.  */
#define   ADCHS_ADCCON2_REFFLT_BG_VREF_OK_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) Band gap and Vref voltage are working properly  */
#define ADCHS_ADCCON2_REFFLT_BG_VREF_FLT      (ADCHS_ADCCON2_REFFLT_BG_VREF_FLT_Val << ADCHS_ADCCON2_REFFLT_Pos) /**< (ADCHS_ADCCON2) Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply. Position  */
#define ADCHS_ADCCON2_REFFLT_BG_VREF_OK       (ADCHS_ADCCON2_REFFLT_BG_VREF_OK_Val << ADCHS_ADCCON2_REFFLT_Pos) /**< (ADCHS_ADCCON2) Band gap and Vref voltage are working properly Position  */
#define ADCHS_ADCCON2_BGVRRDY_Pos             _U_(31)                                              /**< (ADCHS_ADCCON2) Band Gap Voltage/ADC Reference Voltage Status bit Position */
#define ADCHS_ADCCON2_BGVRRDY_Msk             (_U_(0x1) << ADCHS_ADCCON2_BGVRRDY_Pos)              /**< (ADCHS_ADCCON2) Band Gap Voltage/ADC Reference Voltage Status bit Mask */
#define ADCHS_ADCCON2_BGVRRDY(value)          (ADCHS_ADCCON2_BGVRRDY_Msk & ((value) << ADCHS_ADCCON2_BGVRRDY_Pos))
#define   ADCHS_ADCCON2_BGVRRDY_VREF_RDY_Val  _U_(0x1)                                             /**< (ADCHS_ADCCON2) Both band gap voltage and ADC reference voltages (Vref) are ready  */
#define   ADCHS_ADCCON2_BGVRRDY_VREF_NOTRDY_Val _U_(0x0)                                             /**< (ADCHS_ADCCON2) Either or both band gap voltage and ADC reference voltages (Vref) are not ready  */
#define ADCHS_ADCCON2_BGVRRDY_VREF_RDY        (ADCHS_ADCCON2_BGVRRDY_VREF_RDY_Val << ADCHS_ADCCON2_BGVRRDY_Pos) /**< (ADCHS_ADCCON2) Both band gap voltage and ADC reference voltages (Vref) are ready Position  */
#define ADCHS_ADCCON2_BGVRRDY_VREF_NOTRDY     (ADCHS_ADCCON2_BGVRRDY_VREF_NOTRDY_Val << ADCHS_ADCCON2_BGVRRDY_Pos) /**< (ADCHS_ADCCON2) Either or both band gap voltage and ADC reference voltages (Vref) are not ready Position  */
#define ADCHS_ADCCON2_Msk                     _U_(0xE3FFEF7F)                                      /**< (ADCHS_ADCCON2) Register Mask  */


/* -------- ADCHS_ADCCON3 : (ADCHS Offset: 0x20) (R/W 32)  -------- */
#define ADCHS_ADCCON3_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCCON3)   Reset Value */

