Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCCON3_ADINSEL_Pos             _U_(0)                                               /**< (ADCHS_ADCCON3) Analog Input Select bits Position */
#define ADCHS_ADCCON3_ADINSEL_Msk             (_U_(0x3F) << ADCHS_ADCCON3_ADINSEL_Pos)             /**< (ADCHS_ADCCON3) Analog Input Select bits Mask */
#define ADCHS_ADCCON3_ADINSEL(value)          (ADCHS_ADCCON3_ADINSEL_Msk & ((value) << ADCHS_ADCCON3_ADINSEL_Pos))
#define   ADCHS_ADCCON3_ADINSEL_TMP_SENSE_Val _U_(0xB)                                             /**< (ADCHS_ADCCON3) CTMU Temperature Sensor (internal AN11)  */
#define   ADCHS_ADCCON3_ADINSEL_VBATDIV2_SENSE_Val _U_(0xA)                                             /**< (ADCHS_ADCCON3) VBAT/2 (internal AN10)  */
#define   ADCHS_ADCCON3_ADINSEL_1P2V_SENSE_Val _U_(0x9)                                             /**< (ADCHS_ADCCON3) IVref 1.2V (internal AN9)  */
#define   ADCHS_ADCCON3_ADINSEL_BGREF_Val     _U_(0x8)                                             /**< (ADCHS_ADCCON3) BandGap Reference (internal AN8)  */
#define   ADCHS_ADCCON3_ADINSEL_AN7_Val       _U_(0x7)                                             /**< (ADCHS_ADCCON3) AN7  */
#define   ADCHS_ADCCON3_ADINSEL_AN6_Val       _U_(0x6)                                             /**< (ADCHS_ADCCON3) AN6  */
#define   ADCHS_ADCCON3_ADINSEL_AN5_Val       _U_(0x5)                                             /**< (ADCHS_ADCCON3) AN5  */
#define   ADCHS_ADCCON3_ADINSEL_AN4_Val       _U_(0x4)                                             /**< (ADCHS_ADCCON3) AN4  */
#define   ADCHS_ADCCON3_ADINSEL_AN3_Val       _U_(0x3)                                             /**< (ADCHS_ADCCON3) AN3  */
#define   ADCHS_ADCCON3_ADINSEL_AN2_Val       _U_(0x2)                                             /**< (ADCHS_ADCCON3) AN2  */
#define   ADCHS_ADCCON3_ADINSEL_AN1_Val       _U_(0x1)                                             /**< (ADCHS_ADCCON3) AN1  */
#define   ADCHS_ADCCON3_ADINSEL_AN0_Val       _U_(0x0)                                             /**< (ADCHS_ADCCON3) AN0  */
#define ADCHS_ADCCON3_ADINSEL_TMP_SENSE       (ADCHS_ADCCON3_ADINSEL_TMP_SENSE_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) CTMU Temperature Sensor (internal AN11) Position  */
#define ADCHS_ADCCON3_ADINSEL_VBATDIV2_SENSE  (ADCHS_ADCCON3_ADINSEL_VBATDIV2_SENSE_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) VBAT/2 (internal AN10) Position  */
#define ADCHS_ADCCON3_ADINSEL_1P2V_SENSE      (ADCHS_ADCCON3_ADINSEL_1P2V_SENSE_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) IVref 1.2V (internal AN9) Position  */
#define ADCHS_ADCCON3_ADINSEL_BGREF           (ADCHS_ADCCON3_ADINSEL_BGREF_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) BandGap Reference (internal AN8) Position  */
#define ADCHS_ADCCON3_ADINSEL_AN7             (ADCHS_ADCCON3_ADINSEL_AN7_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN7 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN6             (ADCHS_ADCCON3_ADINSEL_AN6_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN6 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN5             (ADCHS_ADCCON3_ADINSEL_AN5_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN5 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN4             (ADCHS_ADCCON3_ADINSEL_AN4_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN4 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN3             (ADCHS_ADCCON3_ADINSEL_AN3_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN3 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN2             (ADCHS_ADCCON3_ADINSEL_AN2_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN2 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN1             (ADCHS_ADCCON3_ADINSEL_AN1_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN1 Position  */
#define ADCHS_ADCCON3_ADINSEL_AN0             (ADCHS_ADCCON3_ADINSEL_AN0_Val << ADCHS_ADCCON3_ADINSEL_Pos) /**< (ADCHS_ADCCON3) AN0 Position  */
#define ADCHS_ADCCON3_GSWTRG_Pos              _U_(6)                                               /**< (ADCHS_ADCCON3) Global Software Trigger bit Position */
#define ADCHS_ADCCON3_GSWTRG_Msk              (_U_(0x1) << ADCHS_ADCCON3_GSWTRG_Pos)               /**< (ADCHS_ADCCON3) Global Software Trigger bit Mask */
#define ADCHS_ADCCON3_GSWTRG(value)           (ADCHS_ADCCON3_GSWTRG_Msk & ((value) << ADCHS_ADCCON3_GSWTRG_Pos))
#define   ADCHS_ADCCON3_GSWTRG_GSWTRG_Val     _U_(0x1)                                             /**< (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC<4:0> bits in the ADCCON1 register the trigger signal  */
#define   ADCHS_ADCCON3_GSWTRG_NO_GSWTRG_Val  _U_(0x0)                                             /**< (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion  */
#define ADCHS_ADCCON3_GSWTRG_GSWTRG           (ADCHS_ADCCON3_GSWTRG_GSWTRG_Val << ADCHS_ADCCON3_GSWTRG_Pos) /**< (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC<4:0> bits in the ADCCON1 register the trigger signal Position  */
#define ADCHS_ADCCON3_GSWTRG_NO_GSWTRG        (ADCHS_ADCCON3_GSWTRG_NO_GSWTRG_Val << ADCHS_ADCCON3_GSWTRG_Pos) /**< (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion Position  */
#define ADCHS_ADCCON3_GLSWTRG_Pos             _U_(7)                                               /**< (ADCHS_ADCCON3) Global Level Software Trigger bit Position */
#define ADCHS_ADCCON3_GLSWTRG_Msk             (_U_(0x1) << ADCHS_ADCCON3_GLSWTRG_Pos)              /**< (ADCHS_ADCCON3) Global Level Software Trigger bit Mask */
#define ADCHS_ADCCON3_GLSWTRG(value)          (ADCHS_ADCCON3_GLSWTRG_Msk & ((value) << ADCHS_ADCCON3_GLSWTRG_Pos))
#define   ADCHS_ADCCON3_GLSWTRG_GLSWTRG_Val   _U_(0x1)                                             /**< (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal  */
#define   ADCHS_ADCCON3_GLSWTRG_NO_GLSWTRG_Val _U_(0x0)                                             /**< (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion  */
#define ADCHS_ADCCON3_GLSWTRG_GLSWTRG         (ADCHS_ADCCON3_GLSWTRG_GLSWTRG_Val << ADCHS_ADCCON3_GLSWTRG_Pos) /**< (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal Position  */
#define ADCHS_ADCCON3_GLSWTRG_NO_GLSWTRG      (ADCHS_ADCCON3_GLSWTRG_NO_GLSWTRG_Val << ADCHS_ADCCON3_GLSWTRG_Pos) /**< (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion Position  */
#define ADCHS_ADCCON3_RQCNVRT_Pos             _U_(8)                                               /**< (ADCHS_ADCCON3) Individual ADC Input Conversion Request bit Position */
#define ADCHS_ADCCON3_RQCNVRT_Msk             (_U_(0x1) << ADCHS_ADCCON3_RQCNVRT_Pos)              /**< (ADCHS_ADCCON3) Individual ADC Input Conversion Request bit Mask */
#define ADCHS_ADCCON3_RQCNVRT(value)          (ADCHS_ADCCON3_RQCNVRT_Msk & ((value) << ADCHS_ADCCON3_RQCNVRT_Pos))
#define   ADCHS_ADCCON3_RQCNVRT_IND_TRIGGER_Val _U_(0x1)                                             /**< (ADCHS_ADCCON3) Trigger the conversion of the selected ADC input as specified by the ADINSEL bits  */
#define   ADCHS_ADCCON3_RQCNVRT_NO_TRIGGER_Val _U_(0x0)                                             /**< (ADCHS_ADCCON3) Do not trigger the conversion  */
#define ADCHS_ADCCON3_RQCNVRT_IND_TRIGGER     (ADCHS_ADCCON3_RQCNVRT_IND_TRIGGER_Val << ADCHS_ADCCON3_RQCNVRT_Pos) /**< (ADCHS_ADCCON3) Trigger the conversion of the selected ADC input as specified by the ADINSEL bits Position  */
#define ADCHS_ADCCON3_RQCNVRT_NO_TRIGGER      (ADCHS_ADCCON3_RQCNVRT_NO_TRIGGER_Val << ADCHS_ADCCON3_RQCNVRT_Pos) /**< (ADCHS_ADCCON3) Do not trigger the conversion Position  */
#define ADCHS_ADCCON3_SAMP_Pos                _U_(9)                                               /**< (ADCHS_ADCCON3) Shared ADC7 Analog Input Sampling Enable bit  Position */
#define ADCHS_ADCCON3_SAMP_Msk                (_U_(0x1) << ADCHS_ADCCON3_SAMP_Pos)                 /**< (ADCHS_ADCCON3) Shared ADC7 Analog Input Sampling Enable bit  Mask */
#define ADCHS_ADCCON3_SAMP(value)             (ADCHS_ADCCON3_SAMP_Msk & ((value) << ADCHS_ADCCON3_SAMP_Pos))
#define   ADCHS_ADCCON3_SAMP_SAMPLE_Val       _U_(0x1)                                             /**< (ADCHS_ADCCON3) The ADC S&H amplifier is sampling  */
#define   ADCHS_ADCCON3_SAMP_HOLD_Val         _U_(0x0)                                             /**< (ADCHS_ADCCON3) The ADC S&H amplifier is holding  */
#define ADCHS_ADCCON3_SAMP_SAMPLE             (ADCHS_ADCCON3_SAMP_SAMPLE_Val << ADCHS_ADCCON3_SAMP_Pos) /**< (ADCHS_ADCCON3) The ADC S&H amplifier is sampling Position  */
#define ADCHS_ADCCON3_SAMP_HOLD               (ADCHS_ADCCON3_SAMP_HOLD_Val << ADCHS_ADCCON3_SAMP_Pos) /**< (ADCHS_ADCCON3) The ADC S&H amplifier is holding Position  */
#define ADCHS_ADCCON3_UPDRDY_Pos              _U_(10)                                              /**< (ADCHS_ADCCON3) ADC Update Ready Status bit Position */
#define ADCHS_ADCCON3_UPDRDY_Msk              (_U_(0x1) << ADCHS_ADCCON3_UPDRDY_Pos)               /**< (ADCHS_ADCCON3) ADC Update Ready Status bit Mask */
#define ADCHS_ADCCON3_UPDRDY(value)           (ADCHS_ADCCON3_UPDRDY_Msk & ((value) << ADCHS_ADCCON3_UPDRDY_Pos))
#define   ADCHS_ADCCON3_UPDRDY_UPDATE_RDY_Val _U_(0x1)                                             /**< (ADCHS_ADCCON3) ADC SFRs can be updated  */
#define   ADCHS_ADCCON3_UPDRDY_UPDATE_NOT_RDY_Val _U_(0x0)                                             /**< (ADCHS_ADCCON3) ADC SFRs cannot be updated  */
#define ADCHS_ADCCON3_UPDRDY_UPDATE_RDY       (ADCHS_ADCCON3_UPDRDY_UPDATE_RDY_Val << ADCHS_ADCCON3_UPDRDY_Pos) /**< (ADCHS_ADCCON3) ADC SFRs can be updated Position  */
#define ADCHS_ADCCON3_UPDRDY_UPDATE_NOT_RDY   (ADCHS_ADCCON3_UPDRDY_UPDATE_NOT_RDY_Val << ADCHS_ADCCON3_UPDRDY_Pos) /**< (ADCHS_ADCCON3) ADC SFRs cannot be updated Position  */
#define ADCHS_ADCCON3_UPDIEN_Pos              _U_(11)                                              /**< (ADCHS_ADCCON3) Update Ready Interrupt Enable bit Position */
#define ADCHS_ADCCON3_UPDIEN_Msk              (_U_(0x1) << ADCHS_ADCCON3_UPDIEN_Pos)               /**< (ADCHS_ADCCON3) Update Ready Interrupt Enable bit Mask */
#define ADCHS_ADCCON3_UPDIEN(value)           (ADCHS_ADCCON3_UPDIEN_Msk & ((value) << ADCHS_ADCCON3_UPDIEN_Pos))
#define   ADCHS_ADCCON3_UPDIEN_INT_ON_UPDATE_RDY_Val _U_(0x1)                                             /**< (ADCHS_ADCCON3) Interrupt will be generated when the UPDRDY bit is set by hardware  */
#define   ADCHS_ADCCON3_UPDIEN_NO_INT_ON_UPDATE_RDY_Val _U_(0x0)                                             /**< (ADCHS_ADCCON3) No interrupt is generated  */
#define ADCHS_ADCCON3_UPDIEN_INT_ON_UPDATE_RDY (ADCHS_ADCCON3_UPDIEN_INT_ON_UPDATE_RDY_Val << ADCHS_ADCCON3_UPDIEN_Pos) /**< (ADCHS_ADCCON3) Interrupt will be generated when the UPDRDY bit is set by hardware Position  */
#define ADCHS_ADCCON3_UPDIEN_NO_INT_ON_UPDATE_RDY (ADCHS_ADCCON3_UPDIEN_NO_INT_ON_UPDATE_RDY_Val << ADCHS_ADCCON3_UPDIEN_Pos) /**< (ADCHS_ADCCON3) No interrupt is generated Position  */
#define ADCHS_ADCCON3_TRGSUSP_Pos             _U_(12)                                              /**< (ADCHS_ADCCON3) Trigger Suspend bit Position */
#define ADCHS_ADCCON3_TRGSUSP_Msk             (_U_(0x1) << ADCHS_ADCCON3_TRGSUSP_Pos)              /**< (ADCHS_ADCCON3) Trigger Suspend bit Mask */
#define ADCHS_ADCCON3_TRGSUSP(value)          (ADCHS_ADCCON3_TRGSUSP_Msk & ((value) << ADCHS_ADCCON3_TRGSUSP_Pos))
#define   ADCHS_ADCCON3_TRGSUSP_TRIG_BLOCKED_Val _U_(0x1)                                             /**< (ADCHS_ADCCON3) Triggers are blocked from starting a new analog-to-digital conversion  */
#define   ADCHS_ADCCON3_TRGSUSP_TRIG_NOT_BLOCKED_Val _U_(0x0)                                             /**< (ADCHS_ADCCON3) Triggers are not blocked  */
#define ADCHS_ADCCON3_TRGSUSP_TRIG_BLOCKED    (ADCHS_ADCCON3_TRGSUSP_TRIG_BLOCKED_Val << ADCHS_ADCCON3_TRGSUSP_Pos) /**< (ADCHS_ADCCON3) Triggers are blocked from starting a new analog-to-digital conversion Position  */
#define ADCHS_ADCCON3_TRGSUSP_TRIG_NOT_BLOCKED (ADCHS_ADCCON3_TRGSUSP_TRIG_NOT_BLOCKED_Val << ADCHS_ADCCON3_TRGSUSP_Pos) /**< (ADCHS_ADCCON3) Triggers are not blocked Position  */
#define ADCHS_ADCCON3_VREFSEL_Pos             _U_(13)                                              /**< (ADCHS_ADCCON3) Voltage Reference Input Selection bits Position */
#define ADCHS_ADCCON3_VREFSEL_Msk             (_U_(0x7) << ADCHS_ADCCON3_VREFSEL_Pos)              /**< (ADCHS_ADCCON3) Voltage Reference Input Selection bits Mask */
#define ADCHS_ADCCON3_VREFSEL(value)          (ADCHS_ADCCON3_VREFSEL_Msk & ((value) << ADCHS_ADCCON3_VREFSEL_Pos))
#define   ADCHS_ADCCON3_VREFSEL_AVDD_AVSS_Val _U_(0x0)                                             /**< (ADCHS_ADCCON3) ADC VREFH is AVDD, ADC VREFL is AVSS  */
#define ADCHS_ADCCON3_VREFSEL_AVDD_AVSS       (ADCHS_ADCCON3_VREFSEL_AVDD_AVSS_Val << ADCHS_ADCCON3_VREFSEL_Pos) /**< (ADCHS_ADCCON3) ADC VREFH is AVDD, ADC VREFL is AVSS Position  */
#define ADCHS_ADCCON3_DIGEN7_Pos              _U_(23)                                              /**< (ADCHS_ADCCON3) Shared ADC (ADC7) Digital Enable bit Position */
#define ADCHS_ADCCON3_DIGEN7_Msk              (_U_(0x1) << ADCHS_ADCCON3_DIGEN7_Pos)               /**< (ADCHS_ADCCON3) Shared ADC (ADC7) Digital Enable bit Mask */
#define ADCHS_ADCCON3_DIGEN7(value)           (ADCHS_ADCCON3_DIGEN7_Msk & ((value) << ADCHS_ADCCON3_DIGEN7_Pos))
#define ADCHS_ADCCON3_CONCLKDIV_Pos           _U_(24)                                              /**< (ADCHS_ADCCON3) Analog-to-Digital Control Clock Divider bits Position */
#define ADCHS_ADCCON3_CONCLKDIV_Msk           (_U_(0x3F) << ADCHS_ADCCON3_CONCLKDIV_Pos)           /**< (ADCHS_ADCCON3) Analog-to-Digital Control Clock Divider bits Mask */
#define ADCHS_ADCCON3_CONCLKDIV(value)        (ADCHS_ADCCON3_CONCLKDIV_Msk & ((value) << ADCHS_ADCCON3_CONCLKDIV_Pos))
#define ADCHS_ADCCON3_ADCSEL_Pos              _U_(30)                                              /**< (ADCHS_ADCCON3) Analog-to-Digital Clock Source bits Position */
#define ADCHS_ADCCON3_ADCSEL_Msk              (_U_(0x3) << ADCHS_ADCCON3_ADCSEL_Pos)               /**< (ADCHS_ADCCON3) Analog-to-Digital Clock Source bits Mask */
#define ADCHS_ADCCON3_ADCSEL(value)           (ADCHS_ADCCON3_ADCSEL_Msk & ((value) << ADCHS_ADCCON3_ADCSEL_Pos))
#define   ADCHS_ADCCON3_ADCSEL_SYSCLK_Val     _U_(0x3)                                             /**< (ADCHS_ADCCON3) SYSCLK  */
#define   ADCHS_ADCCON3_ADCSEL_REFCLK3_Val    _U_(0x2)                                             /**< (ADCHS_ADCCON3) REFCLK3  */
#define   ADCHS_ADCCON3_ADCSEL_FRC_Val        _U_(0x1)                                             /**< (ADCHS_ADCCON3) FRC  */
#define   ADCHS_ADCCON3_ADCSEL_PBCLK1_Val     _U_(0x0)                                             /**< (ADCHS_ADCCON3) PBCLK1  */
#define ADCHS_ADCCON3_ADCSEL_SYSCLK           (ADCHS_ADCCON3_ADCSEL_SYSCLK_Val << ADCHS_ADCCON3_ADCSEL_Pos) /**< (ADCHS_ADCCON3) SYSCLK Position  */
#define ADCHS_ADCCON3_ADCSEL_REFCLK3          (ADCHS_ADCCON3_ADCSEL_REFCLK3_Val << ADCHS_ADCCON3_ADCSEL_Pos) /**< (ADCHS_ADCCON3) REFCLK3 Position  */
#define ADCHS_ADCCON3_ADCSEL_FRC              (ADCHS_ADCCON3_ADCSEL_FRC_Val << ADCHS_ADCCON3_ADCSEL_Pos) /**< (ADCHS_ADCCON3) FRC Position  */
#define ADCHS_ADCCON3_ADCSEL_PBCLK1           (ADCHS_ADCCON3_ADCSEL_PBCLK1_Val << ADCHS_ADCCON3_ADCSEL_Pos) /**< (ADCHS_ADCCON3) PBCLK1 Position  */
#define ADCHS_ADCCON3_Msk                     _U_(0xFF80FFFF)                                      /**< (ADCHS_ADCCON3) Register Mask  */

#define ADCHS_ADCCON3_DIGEN_Pos               _U_(23)                                              /**< (ADCHS_ADCCON3 Position) Shared ADC (ADC7) Digital Enable bit */
#define ADCHS_ADCCON3_DIGEN_Msk               (_U_(0x1) << ADCHS_ADCCON3_DIGEN_Pos)                /**< (ADCHS_ADCCON3 Mask) DIGEN */
#define ADCHS_ADCCON3_DIGEN(value)            (ADCHS_ADCCON3_DIGEN_Msk & ((value) << ADCHS_ADCCON3_DIGEN_Pos)) 

