Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define   ADCHS_ADCIMCON1_DIFF10_DIFF_Val     _U_(0x1)                                             /**< (ADCHS_ADCIMCON1) Selects AN10 differential input pair as AN10+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF10_SINGLE_Val   _U_(0x0)                                             /**< (ADCHS_ADCIMCON1) AN10 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF10_DIFF           (ADCHS_ADCIMCON1_DIFF10_DIFF_Val << ADCHS_ADCIMCON1_DIFF10_Pos) /**< (ADCHS_ADCIMCON1) Selects AN10 differential input pair as AN10+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF10_SINGLE         (ADCHS_ADCIMCON1_DIFF10_SINGLE_Val << ADCHS_ADCIMCON1_DIFF10_Pos) /**< (ADCHS_ADCIMCON1) AN10 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN11_Pos            _U_(22)                                              /**< (ADCHS_ADCIMCON1) AN11 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN11_Msk            (_U_(0x1) << ADCHS_ADCIMCON1_SIGN11_Pos)             /**< (ADCHS_ADCIMCON1) AN11 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN11(value)         (ADCHS_ADCIMCON1_SIGN11_Msk & ((value) << ADCHS_ADCIMCON1_SIGN11_Pos))
#define   ADCHS_ADCIMCON1_SIGN11_SIGNED_Val   _U_(0x1)                                             /**< (ADCHS_ADCIMCON1) AN11 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN11_UNSIGNED_Val _U_(0x0)                                             /**< (ADCHS_ADCIMCON1) AN11 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN11_SIGNED         (ADCHS_ADCIMCON1_SIGN11_SIGNED_Val << ADCHS_ADCIMCON1_SIGN11_Pos) /**< (ADCHS_ADCIMCON1) AN11 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN11_UNSIGNED       (ADCHS_ADCIMCON1_SIGN11_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN11_Pos) /**< (ADCHS_ADCIMCON1) AN11 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF11_Pos            _U_(23)                                              /**< (ADCHS_ADCIMCON1) AN11 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF11_Msk            (_U_(0x1) << ADCHS_ADCIMCON1_DIFF11_Pos)             /**< (ADCHS_ADCIMCON1) AN11 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF11(value)         (ADCHS_ADCIMCON1_DIFF11_Msk & ((value) << ADCHS_ADCIMCON1_DIFF11_Pos))
#define   ADCHS_ADCIMCON1_DIFF11_DIFF_Val     _U_(0x1)                                             /**< (ADCHS_ADCIMCON1) Selects AN11 differential input pair as AN11+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF11_SINGLE_Val   _U_(0x0)                                             /**< (ADCHS_ADCIMCON1) AN11 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF11_DIFF           (ADCHS_ADCIMCON1_DIFF11_DIFF_Val << ADCHS_ADCIMCON1_DIFF11_Pos) /**< (ADCHS_ADCIMCON1) Selects AN11 differential input pair as AN11+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF11_SINGLE         (ADCHS_ADCIMCON1_DIFF11_SINGLE_Val << ADCHS_ADCIMCON1_DIFF11_Pos) /**< (ADCHS_ADCIMCON1) AN11 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_Msk                   _U_(0x00FFFFFF)                                      /**< (ADCHS_ADCIMCON1) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1 : (ADCHS Offset: 0x80) (R/W 32)  -------- */
#define ADCHS_ADCGIRQEN1_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCGIRQEN1)   Reset Value */

#define ADCHS_ADCGIRQEN1_AGIEN0_Pos           _U_(0)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN0_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN0_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN0(value)        (ADCHS_ADCGIRQEN1_AGIEN0_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN0_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN0_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN0_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN0_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN0_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN0_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN0_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN0_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN0_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN1_Pos           _U_(1)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN1_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN1_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN1(value)        (ADCHS_ADCGIRQEN1_AGIEN1_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN1_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN1_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN1_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN1_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN1_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN1_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN1_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN1_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN1_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN2_Pos           _U_(2)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN2_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN2_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN2(value)        (ADCHS_ADCGIRQEN1_AGIEN2_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN2_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN2_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN2_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN2_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN2_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN2_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN2_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN2_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN2_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN3_Pos           _U_(3)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN3_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN3_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN3(value)        (ADCHS_ADCGIRQEN1_AGIEN3_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN3_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN3_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN3_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN3_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN3_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN3_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN3_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN3_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN3_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN4_Pos           _U_(4)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN4_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN4_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN4(value)        (ADCHS_ADCGIRQEN1_AGIEN4_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN4_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN4_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN4_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN4_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN4_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN4_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN4_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN4_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN4_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN5_Pos           _U_(5)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN5_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN5_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN5(value)        (ADCHS_ADCGIRQEN1_AGIEN5_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN5_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN5_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN5_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN5_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN5_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN5_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN5_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN5_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN5_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN6_Pos           _U_(6)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN6_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN6_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN6(value)        (ADCHS_ADCGIRQEN1_AGIEN6_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN6_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN6_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN6_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN6_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN6_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN6_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN6_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN6_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN6_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN7_Pos           _U_(7)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN7_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN7_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN7(value)        (ADCHS_ADCGIRQEN1_AGIEN7_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN7_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN7_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN7_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN7_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN7_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN7_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN7_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN7_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN7_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN8_Pos           _U_(8)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN8_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN8_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN8(value)        (ADCHS_ADCGIRQEN1_AGIEN8_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN8_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN8_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN8_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN8_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN8_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN8_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN8_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN8_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN8_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN9_Pos           _U_(9)                                               /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN9_Msk           (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN9_Pos)            /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN9(value)        (ADCHS_ADCGIRQEN1_AGIEN9_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN9_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN9_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN9_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN9_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN9_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN9_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN9_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN9_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN9_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN10_Pos          _U_(10)                                              /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN10_Msk          (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN10_Pos)           /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN10(value)       (ADCHS_ADCGIRQEN1_AGIEN10_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN10_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN10_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN10_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN10_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN10_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN10_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN10_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN10_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN10_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN11_Pos          _U_(11)                                              /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN11_Msk          (_U_(0x1) << ADCHS_ADCGIRQEN1_AGIEN11_Pos)           /**< (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN11(value)       (ADCHS_ADCGIRQEN1_AGIEN11_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN11_Pos))
#define   ADCHS_ADCGIRQEN1_AGIEN11_ENABLED_Val _U_(0x1)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN11_DISABLED_Val _U_(0x0)                                             /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN11_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN11_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN11_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN11_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN11_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN11_Pos) /**< (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_Msk                  _U_(0x00000FFF)                                      /**< (ADCHS_ADCGIRQEN1) Register Mask  */

#define ADCHS_ADCGIRQEN1_AGIEN_Pos            _U_(0)                                               /**< (ADCHS_ADCGIRQEN1 Position) ADC Global Interrupt Enable bit */
#define ADCHS_ADCGIRQEN1_AGIEN_Msk            (_U_(0xFFF) << ADCHS_ADCGIRQEN1_AGIEN_Pos)           /**< (ADCHS_ADCGIRQEN1 Mask) AGIEN */
#define ADCHS_ADCGIRQEN1_AGIEN(value)         (ADCHS_ADCGIRQEN1_AGIEN_Msk & ((value) << ADCHS_ADCGIRQEN1_AGIEN_Pos)) 

