Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCCSS1 : (ADCHS Offset: 0xA0) (R/W 32)  -------- */
#define ADCHS_ADCCSS1_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCCSS1)   Reset Value */

#define ADCHS_ADCCSS1_CSS0_Pos                _U_(0)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS0_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS0_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS0(value)             (ADCHS_ADCCSS1_CSS0_Msk & ((value) << ADCHS_ADCCSS1_CSS0_Pos))
#define   ADCHS_ADCCSS1_CSS0_SEL_AN0_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS0_SKIP_AN0_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS0_SEL_AN0            (ADCHS_ADCCSS1_CSS0_SEL_AN0_Val << ADCHS_ADCCSS1_CSS0_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS0_SKIP_AN0           (ADCHS_ADCCSS1_CSS0_SKIP_AN0_Val << ADCHS_ADCCSS1_CSS0_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS1_Pos                _U_(1)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS1_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS1_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS1(value)             (ADCHS_ADCCSS1_CSS1_Msk & ((value) << ADCHS_ADCCSS1_CSS1_Pos))
#define   ADCHS_ADCCSS1_CSS1_SEL_AN1_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS1_SKIP_AN1_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS1_SEL_AN1            (ADCHS_ADCCSS1_CSS1_SEL_AN1_Val << ADCHS_ADCCSS1_CSS1_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS1_SKIP_AN1           (ADCHS_ADCCSS1_CSS1_SKIP_AN1_Val << ADCHS_ADCCSS1_CSS1_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS2_Pos                _U_(2)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS2_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS2_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS2(value)             (ADCHS_ADCCSS1_CSS2_Msk & ((value) << ADCHS_ADCCSS1_CSS2_Pos))
#define   ADCHS_ADCCSS1_CSS2_SEL_AN2_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS2_SKIP_AN2_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS2_SEL_AN2            (ADCHS_ADCCSS1_CSS2_SEL_AN2_Val << ADCHS_ADCCSS1_CSS2_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS2_SKIP_AN2           (ADCHS_ADCCSS1_CSS2_SKIP_AN2_Val << ADCHS_ADCCSS1_CSS2_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS3_Pos                _U_(3)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS3_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS3_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS3(value)             (ADCHS_ADCCSS1_CSS3_Msk & ((value) << ADCHS_ADCCSS1_CSS3_Pos))
#define   ADCHS_ADCCSS1_CSS3_SEL_AN3_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS3_SKIP_AN3_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS3_SEL_AN3            (ADCHS_ADCCSS1_CSS3_SEL_AN3_Val << ADCHS_ADCCSS1_CSS3_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS3_SKIP_AN3           (ADCHS_ADCCSS1_CSS3_SKIP_AN3_Val << ADCHS_ADCCSS1_CSS3_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS4_Pos                _U_(4)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS4_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS4_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS4(value)             (ADCHS_ADCCSS1_CSS4_Msk & ((value) << ADCHS_ADCCSS1_CSS4_Pos))
#define   ADCHS_ADCCSS1_CSS4_SEL_AN4_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS4_SKIP_AN4_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS4_SEL_AN4            (ADCHS_ADCCSS1_CSS4_SEL_AN4_Val << ADCHS_ADCCSS1_CSS4_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS4_SKIP_AN4           (ADCHS_ADCCSS1_CSS4_SKIP_AN4_Val << ADCHS_ADCCSS1_CSS4_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS5_Pos                _U_(5)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS5_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS5_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS5(value)             (ADCHS_ADCCSS1_CSS5_Msk & ((value) << ADCHS_ADCCSS1_CSS5_Pos))
#define   ADCHS_ADCCSS1_CSS5_SEL_AN5_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS5_SKIP_AN5_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS5_SEL_AN5            (ADCHS_ADCCSS1_CSS5_SEL_AN5_Val << ADCHS_ADCCSS1_CSS5_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS5_SKIP_AN5           (ADCHS_ADCCSS1_CSS5_SKIP_AN5_Val << ADCHS_ADCCSS1_CSS5_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS6_Pos                _U_(6)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS6_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS6_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS6(value)             (ADCHS_ADCCSS1_CSS6_Msk & ((value) << ADCHS_ADCCSS1_CSS6_Pos))
#define   ADCHS_ADCCSS1_CSS6_SEL_AN6_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS6_SKIP_AN6_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS6_SEL_AN6            (ADCHS_ADCCSS1_CSS6_SEL_AN6_Val << ADCHS_ADCCSS1_CSS6_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS6_SKIP_AN6           (ADCHS_ADCCSS1_CSS6_SKIP_AN6_Val << ADCHS_ADCCSS1_CSS6_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS7_Pos                _U_(7)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS7_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS7_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS7(value)             (ADCHS_ADCCSS1_CSS7_Msk & ((value) << ADCHS_ADCCSS1_CSS7_Pos))
#define   ADCHS_ADCCSS1_CSS7_SEL_AN7_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS7_SKIP_AN7_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS7_SEL_AN7            (ADCHS_ADCCSS1_CSS7_SEL_AN7_Val << ADCHS_ADCCSS1_CSS7_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS7_SKIP_AN7           (ADCHS_ADCCSS1_CSS7_SKIP_AN7_Val << ADCHS_ADCCSS1_CSS7_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS8_Pos                _U_(8)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS8_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS8_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS8(value)             (ADCHS_ADCCSS1_CSS8_Msk & ((value) << ADCHS_ADCCSS1_CSS8_Pos))
#define   ADCHS_ADCCSS1_CSS8_SEL_AN8_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS8_SKIP_AN8_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS8_SEL_AN8            (ADCHS_ADCCSS1_CSS8_SEL_AN8_Val << ADCHS_ADCCSS1_CSS8_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS8_SKIP_AN8           (ADCHS_ADCCSS1_CSS8_SKIP_AN8_Val << ADCHS_ADCCSS1_CSS8_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS9_Pos                _U_(9)                                               /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS9_Msk                (_U_(0x1) << ADCHS_ADCCSS1_CSS9_Pos)                 /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS9(value)             (ADCHS_ADCCSS1_CSS9_Msk & ((value) << ADCHS_ADCCSS1_CSS9_Pos))
#define   ADCHS_ADCCSS1_CSS9_SEL_AN9_Val      _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS9_SKIP_AN9_Val     _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS9_SEL_AN9            (ADCHS_ADCCSS1_CSS9_SEL_AN9_Val << ADCHS_ADCCSS1_CSS9_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS9_SKIP_AN9           (ADCHS_ADCCSS1_CSS9_SKIP_AN9_Val << ADCHS_ADCCSS1_CSS9_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS10_Pos               _U_(10)                                              /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS10_Msk               (_U_(0x1) << ADCHS_ADCCSS1_CSS10_Pos)                /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS10(value)            (ADCHS_ADCCSS1_CSS10_Msk & ((value) << ADCHS_ADCCSS1_CSS10_Pos))
#define   ADCHS_ADCCSS1_CSS10_SEL_AN10_Val    _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS10_SKIP_AN10_Val   _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS10_SEL_AN10          (ADCHS_ADCCSS1_CSS10_SEL_AN10_Val << ADCHS_ADCCSS1_CSS10_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS10_SKIP_AN10         (ADCHS_ADCCSS1_CSS10_SKIP_AN10_Val << ADCHS_ADCCSS1_CSS10_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS11_Pos               _U_(11)                                              /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS11_Msk               (_U_(0x1) << ADCHS_ADCCSS1_CSS11_Pos)                /**< (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS11(value)            (ADCHS_ADCCSS1_CSS11_Msk & ((value) << ADCHS_ADCCSS1_CSS11_Pos))
#define   ADCHS_ADCCSS1_CSS11_SEL_AN11_Val    _U_(0x1)                                             /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS11_SKIP_AN11_Val   _U_(0x0)                                             /**< (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS11_SEL_AN11          (ADCHS_ADCCSS1_CSS11_SEL_AN11_Val << ADCHS_ADCCSS1_CSS11_Pos) /**< (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS11_SKIP_AN11         (ADCHS_ADCCSS1_CSS11_SKIP_AN11_Val << ADCHS_ADCCSS1_CSS11_Pos) /**< (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_Msk                     _U_(0x00000FFF)                                      /**< (ADCHS_ADCCSS1) Register Mask  */

#define ADCHS_ADCCSS1_CSS_Pos                 _U_(0)                                               /**< (ADCHS_ADCCSS1 Position) Analog Common Scan Select bits */
#define ADCHS_ADCCSS1_CSS_Msk                 (_U_(0xFFF) << ADCHS_ADCCSS1_CSS_Pos)                /**< (ADCHS_ADCCSS1 Mask) CSS */
#define ADCHS_ADCCSS1_CSS(value)              (ADCHS_ADCCSS1_CSS_Msk & ((value) << ADCHS_ADCCSS1_CSS_Pos)) 

/* -------- ADCHS_ADCDSTAT1 : (ADCHS Offset: 0xC0) (R/W 32)  -------- */
#define ADCHS_ADCDSTAT1_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADCDSTAT1)   Reset Value */

