Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCDSTAT1_ARDY0_Pos             _U_(0)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY0_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY0_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY0(value)          (ADCHS_ADCDSTAT1_ARDY0_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY0_Pos))
#define ADCHS_ADCDSTAT1_ARDY1_Pos             _U_(1)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY1_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY1_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY1(value)          (ADCHS_ADCDSTAT1_ARDY1_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY1_Pos))
#define ADCHS_ADCDSTAT1_ARDY2_Pos             _U_(2)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY2_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY2_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY2(value)          (ADCHS_ADCDSTAT1_ARDY2_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY2_Pos))
#define ADCHS_ADCDSTAT1_ARDY3_Pos             _U_(3)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY3_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY3_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY3(value)          (ADCHS_ADCDSTAT1_ARDY3_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY3_Pos))
#define ADCHS_ADCDSTAT1_ARDY4_Pos             _U_(4)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY4_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY4_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY4(value)          (ADCHS_ADCDSTAT1_ARDY4_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY4_Pos))
#define ADCHS_ADCDSTAT1_ARDY5_Pos             _U_(5)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY5_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY5_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY5(value)          (ADCHS_ADCDSTAT1_ARDY5_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY5_Pos))
#define ADCHS_ADCDSTAT1_ARDY6_Pos             _U_(6)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY6_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY6_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY6(value)          (ADCHS_ADCDSTAT1_ARDY6_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY6_Pos))
#define ADCHS_ADCDSTAT1_ARDY7_Pos             _U_(7)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY7_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY7_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY7(value)          (ADCHS_ADCDSTAT1_ARDY7_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY7_Pos))
#define ADCHS_ADCDSTAT1_ARDY8_Pos             _U_(8)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY8_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY8_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY8(value)          (ADCHS_ADCDSTAT1_ARDY8_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY8_Pos))
#define ADCHS_ADCDSTAT1_ARDY9_Pos             _U_(9)                                               /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY9_Msk             (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY9_Pos)              /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY9(value)          (ADCHS_ADCDSTAT1_ARDY9_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY9_Pos))
#define ADCHS_ADCDSTAT1_ARDY10_Pos            _U_(10)                                              /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY10_Msk            (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY10_Pos)             /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY10(value)         (ADCHS_ADCDSTAT1_ARDY10_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY10_Pos))
#define ADCHS_ADCDSTAT1_ARDY11_Pos            _U_(11)                                              /**< (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY11_Msk            (_U_(0x1) << ADCHS_ADCDSTAT1_ARDY11_Pos)             /**< (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY11(value)         (ADCHS_ADCDSTAT1_ARDY11_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY11_Pos))
#define ADCHS_ADCDSTAT1_Msk                   _U_(0x00000FFF)                                      /**< (ADCHS_ADCDSTAT1) Register Mask  */

#define ADCHS_ADCDSTAT1_ARDY_Pos              _U_(0)                                               /**< (ADCHS_ADCDSTAT1 Position)  */
#define ADCHS_ADCDSTAT1_ARDY_Msk              (_U_(0xFFF) << ADCHS_ADCDSTAT1_ARDY_Pos)             /**< (ADCHS_ADCDSTAT1 Mask) ARDY */
#define ADCHS_ADCDSTAT1_ARDY(value)           (ADCHS_ADCDSTAT1_ARDY_Msk & ((value) << ADCHS_ADCDSTAT1_ARDY_Pos)) 

/* -------- ADCHS_ADCCMPEN1 : (ADCHS Offset: 0xE0) (R/W 32)  -------- */
#define ADCHS_ADCCMPEN1_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN1)   Reset Value */

#define ADCHS_ADCCMPEN1_CMPE0_Pos             _U_(0)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE0_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE0_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE0(value)          (ADCHS_ADCCMPEN1_CMPE0_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE0_Pos))
#define ADCHS_ADCCMPEN1_CMPE1_Pos             _U_(1)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE1_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE1_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE1(value)          (ADCHS_ADCCMPEN1_CMPE1_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE1_Pos))
#define ADCHS_ADCCMPEN1_CMPE2_Pos             _U_(2)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE2_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE2_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE2(value)          (ADCHS_ADCCMPEN1_CMPE2_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE2_Pos))
#define ADCHS_ADCCMPEN1_CMPE3_Pos             _U_(3)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE3_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE3_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE3(value)          (ADCHS_ADCCMPEN1_CMPE3_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE3_Pos))
#define ADCHS_ADCCMPEN1_CMPE4_Pos             _U_(4)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE4_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE4_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE4(value)          (ADCHS_ADCCMPEN1_CMPE4_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE4_Pos))
#define ADCHS_ADCCMPEN1_CMPE5_Pos             _U_(5)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE5_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE5_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE5(value)          (ADCHS_ADCCMPEN1_CMPE5_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE5_Pos))
#define ADCHS_ADCCMPEN1_CMPE6_Pos             _U_(6)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE6_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE6_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE6(value)          (ADCHS_ADCCMPEN1_CMPE6_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE6_Pos))
#define ADCHS_ADCCMPEN1_CMPE7_Pos             _U_(7)                                               /**< (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE7_Msk             (_U_(0x1) << ADCHS_ADCCMPEN1_CMPE7_Pos)              /**< (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE7(value)          (ADCHS_ADCCMPEN1_CMPE7_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE7_Pos))
#define ADCHS_ADCCMPEN1_Msk                   _U_(0x000000FF)                                      /**< (ADCHS_ADCCMPEN1) Register Mask  */

#define ADCHS_ADCCMPEN1_CMPE_Pos              _U_(0)                                               /**< (ADCHS_ADCCMPEN1 Position)  */
#define ADCHS_ADCCMPEN1_CMPE_Msk              (_U_(0xFF) << ADCHS_ADCCMPEN1_CMPE_Pos)              /**< (ADCHS_ADCCMPEN1 Mask) CMPE */
#define ADCHS_ADCCMPEN1_CMPE(value)           (ADCHS_ADCCMPEN1_CMPE_Msk & ((value) << ADCHS_ADCCMPEN1_CMPE_Pos)) 

