Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCCMP1 : (ADCHS Offset: 0xF0) (R/W 32)  -------- */
#define ADCHS_ADCCMP1_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCCMP1)   Reset Value */

#define ADCHS_ADCCMP1_ADCMPLO_Pos             _U_(0)                                               /**< (ADCHS_ADCCMP1)  Position */
#define ADCHS_ADCCMP1_ADCMPLO_Msk             (_U_(0xFFFF) << ADCHS_ADCCMP1_ADCMPLO_Pos)           /**< (ADCHS_ADCCMP1)  Mask */
#define ADCHS_ADCCMP1_ADCMPLO(value)          (ADCHS_ADCCMP1_ADCMPLO_Msk & ((value) << ADCHS_ADCCMP1_ADCMPLO_Pos))
#define ADCHS_ADCCMP1_ADCMPHI_Pos             _U_(16)                                              /**< (ADCHS_ADCCMP1)  Position */
#define ADCHS_ADCCMP1_ADCMPHI_Msk             (_U_(0xFFFF) << ADCHS_ADCCMP1_ADCMPHI_Pos)           /**< (ADCHS_ADCCMP1)  Mask */
#define ADCHS_ADCCMP1_ADCMPHI(value)          (ADCHS_ADCCMP1_ADCMPHI_Msk & ((value) << ADCHS_ADCCMP1_ADCMPHI_Pos))
#define ADCHS_ADCCMP1_Msk                     _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCCMP1) Register Mask  */


/* -------- ADCHS_ADCCMPEN2 : (ADCHS Offset: 0x100) (R/W 32)  -------- */
#define ADCHS_ADCCMPEN2_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN2)   Reset Value */

#define ADCHS_ADCCMPEN2_CMPE0_Pos             _U_(0)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE0_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE0_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE0(value)          (ADCHS_ADCCMPEN2_CMPE0_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE0_Pos))
#define ADCHS_ADCCMPEN2_CMPE1_Pos             _U_(1)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE1_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE1_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE1(value)          (ADCHS_ADCCMPEN2_CMPE1_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE1_Pos))
#define ADCHS_ADCCMPEN2_CMPE2_Pos             _U_(2)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE2_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE2_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE2(value)          (ADCHS_ADCCMPEN2_CMPE2_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE2_Pos))
#define ADCHS_ADCCMPEN2_CMPE3_Pos             _U_(3)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE3_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE3_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE3(value)          (ADCHS_ADCCMPEN2_CMPE3_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE3_Pos))
#define ADCHS_ADCCMPEN2_CMPE4_Pos             _U_(4)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE4_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE4_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE4(value)          (ADCHS_ADCCMPEN2_CMPE4_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE4_Pos))
#define ADCHS_ADCCMPEN2_CMPE5_Pos             _U_(5)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE5_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE5_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE5(value)          (ADCHS_ADCCMPEN2_CMPE5_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE5_Pos))
#define ADCHS_ADCCMPEN2_CMPE6_Pos             _U_(6)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE6_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE6_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE6(value)          (ADCHS_ADCCMPEN2_CMPE6_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE6_Pos))
#define ADCHS_ADCCMPEN2_CMPE7_Pos             _U_(7)                                               /**< (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE7_Msk             (_U_(0x1) << ADCHS_ADCCMPEN2_CMPE7_Pos)              /**< (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE7(value)          (ADCHS_ADCCMPEN2_CMPE7_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE7_Pos))
#define ADCHS_ADCCMPEN2_Msk                   _U_(0x000000FF)                                      /**< (ADCHS_ADCCMPEN2) Register Mask  */

#define ADCHS_ADCCMPEN2_CMPE_Pos              _U_(0)                                               /**< (ADCHS_ADCCMPEN2 Position)  */
#define ADCHS_ADCCMPEN2_CMPE_Msk              (_U_(0xFF) << ADCHS_ADCCMPEN2_CMPE_Pos)              /**< (ADCHS_ADCCMPEN2 Mask) CMPE */
#define ADCHS_ADCCMPEN2_CMPE(value)           (ADCHS_ADCCMPEN2_CMPE_Msk & ((value) << ADCHS_ADCCMPEN2_CMPE_Pos)) 

/* -------- ADCHS_ADCCMP2 : (ADCHS Offset: 0x110) (R/W 32)  -------- */
#define ADCHS_ADCCMP2_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCCMP2)   Reset Value */

#define ADCHS_ADCCMP2_ADCMPLO_Pos             _U_(0)                                               /**< (ADCHS_ADCCMP2)  Position */
#define ADCHS_ADCCMP2_ADCMPLO_Msk             (_U_(0xFFFF) << ADCHS_ADCCMP2_ADCMPLO_Pos)           /**< (ADCHS_ADCCMP2)  Mask */
#define ADCHS_ADCCMP2_ADCMPLO(value)          (ADCHS_ADCCMP2_ADCMPLO_Msk & ((value) << ADCHS_ADCCMP2_ADCMPLO_Pos))
#define ADCHS_ADCCMP2_ADCMPHI_Pos             _U_(16)                                              /**< (ADCHS_ADCCMP2)  Position */
#define ADCHS_ADCCMP2_ADCMPHI_Msk             (_U_(0xFFFF) << ADCHS_ADCCMP2_ADCMPHI_Pos)           /**< (ADCHS_ADCCMP2)  Mask */
#define ADCHS_ADCCMP2_ADCMPHI(value)          (ADCHS_ADCCMP2_ADCMPHI_Msk & ((value) << ADCHS_ADCCMP2_ADCMPHI_Pos))
#define ADCHS_ADCCMP2_Msk                     _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCCMP2) Register Mask  */


/* -------- ADCHS_ADCFLTR1 : (ADCHS Offset: 0x1A0) (R/W 32)  -------- */
#define ADCHS_ADCFLTR1_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCFLTR1)   Reset Value */

#define ADCHS_ADCFLTR1_FLT_DATA0_Pos          _U_(0)                                               /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_FLT_DATA0_Msk          (_U_(0xFFFF) << ADCHS_ADCFLTR1_FLT_DATA0_Pos)        /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_FLT_DATA0(value)       (ADCHS_ADCFLTR1_FLT_DATA0_Msk & ((value) << ADCHS_ADCFLTR1_FLT_DATA0_Pos))
#define ADCHS_ADCFLTR1_FLTINID0_Pos           _U_(16)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_FLTINID0_Msk           (_U_(0x1F) << ADCHS_ADCFLTR1_FLTINID0_Pos)           /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_FLTINID0(value)        (ADCHS_ADCFLTR1_FLTINID0_Msk & ((value) << ADCHS_ADCFLTR1_FLTINID0_Pos))
#define ADCHS_ADCFLTR1_AFIF0_Pos              _U_(24)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFIF0_Msk              (_U_(0x1) << ADCHS_ADCFLTR1_AFIF0_Pos)               /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFIF0(value)           (ADCHS_ADCFLTR1_AFIF0_Msk & ((value) << ADCHS_ADCFLTR1_AFIF0_Pos))
#define ADCHS_ADCFLTR1_AFIEN0_Pos             _U_(25)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFIEN0_Msk             (_U_(0x1) << ADCHS_ADCFLTR1_AFIEN0_Pos)              /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFIEN0(value)          (ADCHS_ADCFLTR1_AFIEN0_Msk & ((value) << ADCHS_ADCFLTR1_AFIEN0_Pos))
#define ADCHS_ADCFLTR1_OVRSAM0_Pos            _U_(26)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_OVRSAM0_Msk            (_U_(0x7) << ADCHS_ADCFLTR1_OVRSAM0_Pos)             /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_OVRSAM0(value)         (ADCHS_ADCFLTR1_OVRSAM0_Msk & ((value) << ADCHS_ADCFLTR1_OVRSAM0_Pos))
#define ADCHS_ADCFLTR1_ADFMODE0_Pos           _U_(29)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_ADFMODE0_Msk           (_U_(0x1) << ADCHS_ADCFLTR1_ADFMODE0_Pos)            /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_ADFMODE0(value)        (ADCHS_ADCFLTR1_ADFMODE0_Msk & ((value) << ADCHS_ADCFLTR1_ADFMODE0_Pos))
#define ADCHS_ADCFLTR1_DATA16EN0_Pos          _U_(30)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_DATA16EN0_Msk          (_U_(0x1) << ADCHS_ADCFLTR1_DATA16EN0_Pos)           /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_DATA16EN0(value)       (ADCHS_ADCFLTR1_DATA16EN0_Msk & ((value) << ADCHS_ADCFLTR1_DATA16EN0_Pos))
#define ADCHS_ADCFLTR1_AFEN0_Pos              _U_(31)                                              /**< (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFEN0_Msk              (_U_(0x1) << ADCHS_ADCFLTR1_AFEN0_Pos)               /**< (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFEN0(value)           (ADCHS_ADCFLTR1_AFEN0_Msk & ((value) << ADCHS_ADCFLTR1_AFEN0_Pos))
#define ADCHS_ADCFLTR1_Msk                    _U_(0xFF1FFFFF)                                      /**< (ADCHS_ADCFLTR1) Register Mask  */

