Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCFLTR1_AFIF_Pos               _U_(24)                                              /**< (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFIF_Msk               (_U_(0x1) << ADCHS_ADCFLTR1_AFIF_Pos)                /**< (ADCHS_ADCFLTR1 Mask) AFIF */
#define ADCHS_ADCFLTR1_AFIF(value)            (ADCHS_ADCFLTR1_AFIF_Msk & ((value) << ADCHS_ADCFLTR1_AFIF_Pos)) 
#define ADCHS_ADCFLTR1_AFIEN_Pos              _U_(25)                                              /**< (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFIEN_Msk              (_U_(0x1) << ADCHS_ADCFLTR1_AFIEN_Pos)               /**< (ADCHS_ADCFLTR1 Mask) AFIEN */
#define ADCHS_ADCFLTR1_AFIEN(value)           (ADCHS_ADCFLTR1_AFIEN_Msk & ((value) << ADCHS_ADCFLTR1_AFIEN_Pos)) 
#define ADCHS_ADCFLTR1_ADFMODE_Pos            _U_(29)                                              /**< (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_ADFMODE_Msk            (_U_(0x1) << ADCHS_ADCFLTR1_ADFMODE_Pos)             /**< (ADCHS_ADCFLTR1 Mask) ADFMODE */
#define ADCHS_ADCFLTR1_ADFMODE(value)         (ADCHS_ADCFLTR1_ADFMODE_Msk & ((value) << ADCHS_ADCFLTR1_ADFMODE_Pos)) 
#define ADCHS_ADCFLTR1_DATA16EN_Pos           _U_(30)                                              /**< (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_DATA16EN_Msk           (_U_(0x1) << ADCHS_ADCFLTR1_DATA16EN_Pos)            /**< (ADCHS_ADCFLTR1 Mask) DATA16EN */
#define ADCHS_ADCFLTR1_DATA16EN(value)        (ADCHS_ADCFLTR1_DATA16EN_Msk & ((value) << ADCHS_ADCFLTR1_DATA16EN_Pos)) 
#define ADCHS_ADCFLTR1_AFEN_Pos               _U_(31)                                              /**< (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFEN_Msk               (_U_(0x1) << ADCHS_ADCFLTR1_AFEN_Pos)                /**< (ADCHS_ADCFLTR1 Mask) AFEN */
#define ADCHS_ADCFLTR1_AFEN(value)            (ADCHS_ADCFLTR1_AFEN_Msk & ((value) << ADCHS_ADCFLTR1_AFEN_Pos)) 

/* -------- ADCHS_ADCFLTR2 : (ADCHS Offset: 0x1B0) (R/W 32)  -------- */
#define ADCHS_ADCFLTR2_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCFLTR2)   Reset Value */

#define ADCHS_ADCFLTR2_FLT_DATA1_Pos          _U_(0)                                               /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_FLT_DATA1_Msk          (_U_(0xFFFF) << ADCHS_ADCFLTR2_FLT_DATA1_Pos)        /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_FLT_DATA1(value)       (ADCHS_ADCFLTR2_FLT_DATA1_Msk & ((value) << ADCHS_ADCFLTR2_FLT_DATA1_Pos))
#define ADCHS_ADCFLTR2_FLTINID1_Pos           _U_(16)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_FLTINID1_Msk           (_U_(0x1F) << ADCHS_ADCFLTR2_FLTINID1_Pos)           /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_FLTINID1(value)        (ADCHS_ADCFLTR2_FLTINID1_Msk & ((value) << ADCHS_ADCFLTR2_FLTINID1_Pos))
#define ADCHS_ADCFLTR2_AFIF1_Pos              _U_(24)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_AFIF1_Msk              (_U_(0x1) << ADCHS_ADCFLTR2_AFIF1_Pos)               /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_AFIF1(value)           (ADCHS_ADCFLTR2_AFIF1_Msk & ((value) << ADCHS_ADCFLTR2_AFIF1_Pos))
#define ADCHS_ADCFLTR2_AFIEN1_Pos             _U_(25)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_AFIEN1_Msk             (_U_(0x1) << ADCHS_ADCFLTR2_AFIEN1_Pos)              /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_AFIEN1(value)          (ADCHS_ADCFLTR2_AFIEN1_Msk & ((value) << ADCHS_ADCFLTR2_AFIEN1_Pos))
#define ADCHS_ADCFLTR2_OVRSAM1_Pos            _U_(26)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_OVRSAM1_Msk            (_U_(0x7) << ADCHS_ADCFLTR2_OVRSAM1_Pos)             /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_OVRSAM1(value)         (ADCHS_ADCFLTR2_OVRSAM1_Msk & ((value) << ADCHS_ADCFLTR2_OVRSAM1_Pos))
#define ADCHS_ADCFLTR2_ADFMODE1_Pos           _U_(29)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_ADFMODE1_Msk           (_U_(0x1) << ADCHS_ADCFLTR2_ADFMODE1_Pos)            /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_ADFMODE1(value)        (ADCHS_ADCFLTR2_ADFMODE1_Msk & ((value) << ADCHS_ADCFLTR2_ADFMODE1_Pos))
#define ADCHS_ADCFLTR2_DATA16EN1_Pos          _U_(30)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_DATA16EN1_Msk          (_U_(0x1) << ADCHS_ADCFLTR2_DATA16EN1_Pos)           /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_DATA16EN1(value)       (ADCHS_ADCFLTR2_DATA16EN1_Msk & ((value) << ADCHS_ADCFLTR2_DATA16EN1_Pos))
#define ADCHS_ADCFLTR2_AFEN1_Pos              _U_(31)                                              /**< (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_AFEN1_Msk              (_U_(0x1) << ADCHS_ADCFLTR2_AFEN1_Pos)               /**< (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_AFEN1(value)           (ADCHS_ADCFLTR2_AFEN1_Msk & ((value) << ADCHS_ADCFLTR2_AFEN1_Pos))
#define ADCHS_ADCFLTR2_Msk                    _U_(0xFF1FFFFF)                                      /**< (ADCHS_ADCFLTR2) Register Mask  */

#define ADCHS_ADCFLTR2_AFIF_Pos               _U_(24)                                              /**< (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_AFIF_Msk               (_U_(0x1) << ADCHS_ADCFLTR2_AFIF_Pos)                /**< (ADCHS_ADCFLTR2 Mask) AFIF */
#define ADCHS_ADCFLTR2_AFIF(value)            (ADCHS_ADCFLTR2_AFIF_Msk & ((value) << ADCHS_ADCFLTR2_AFIF_Pos)) 
#define ADCHS_ADCFLTR2_AFIEN_Pos              _U_(25)                                              /**< (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_AFIEN_Msk              (_U_(0x1) << ADCHS_ADCFLTR2_AFIEN_Pos)               /**< (ADCHS_ADCFLTR2 Mask) AFIEN */
#define ADCHS_ADCFLTR2_AFIEN(value)           (ADCHS_ADCFLTR2_AFIEN_Msk & ((value) << ADCHS_ADCFLTR2_AFIEN_Pos)) 
#define ADCHS_ADCFLTR2_ADFMODE_Pos            _U_(29)                                              /**< (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_ADFMODE_Msk            (_U_(0x1) << ADCHS_ADCFLTR2_ADFMODE_Pos)             /**< (ADCHS_ADCFLTR2 Mask) ADFMODE */
#define ADCHS_ADCFLTR2_ADFMODE(value)         (ADCHS_ADCFLTR2_ADFMODE_Msk & ((value) << ADCHS_ADCFLTR2_ADFMODE_Pos)) 
#define ADCHS_ADCFLTR2_DATA16EN_Pos           _U_(30)                                              /**< (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_DATA16EN_Msk           (_U_(0x1) << ADCHS_ADCFLTR2_DATA16EN_Pos)            /**< (ADCHS_ADCFLTR2 Mask) DATA16EN */
#define ADCHS_ADCFLTR2_DATA16EN(value)        (ADCHS_ADCFLTR2_DATA16EN_Msk & ((value) << ADCHS_ADCFLTR2_DATA16EN_Pos)) 
#define ADCHS_ADCFLTR2_AFEN_Pos               _U_(31)                                              /**< (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_AFEN_Msk               (_U_(0x1) << ADCHS_ADCFLTR2_AFEN_Pos)                /**< (ADCHS_ADCFLTR2 Mask) AFEN */
#define ADCHS_ADCFLTR2_AFEN(value)            (ADCHS_ADCFLTR2_AFEN_Msk & ((value) << ADCHS_ADCFLTR2_AFEN_Pos)) 

/* -------- ADCHS_ADCTRG1 : (ADCHS Offset: 0x200) (R/W 32) ADC Trigger Source 1 Register -------- */
#define ADCHS_ADCTRG1_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCTRG1) ADC Trigger Source 1 Register  Reset Value */

