Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCTRG1_TRGSRC0_Pos             _U_(0)                                               /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC0 Module Select bits Position */
#define ADCHS_ADCTRG1_TRGSRC0_Msk             (_U_(0x1F) << ADCHS_ADCTRG1_TRGSRC0_Pos)             /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC0 Module Select bits Mask */
#define ADCHS_ADCTRG1_TRGSRC0(value)          (ADCHS_ADCTRG1_TRGSRC0_Msk & ((value) << ADCHS_ADCTRG1_TRGSRC0_Pos))
#define   ADCHS_ADCTRG1_TRGSRC0_RESERVED_Val  _U_(0x1F)                                            /**< (ADCHS_ADCTRG1) RESERVED  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_47_Val  _U_(0x10)                                            /**< (ADCHS_ADCTRG1) ADC_TRIG_16  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_46_Val  _U_(0xF)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_15  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_45_Val  _U_(0xE)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_14  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_44_Val  _U_(0xD)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_13  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_43_Val  _U_(0xC)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_12  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_42_Val  _U_(0xB)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_11  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_41_Val  _U_(0xA)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_10  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_40_Val  _U_(0x9)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_9  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_39_Val  _U_(0x8)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_8  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_38_Val  _U_(0x7)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_7  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_37_Val  _U_(0x6)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_6  */
#define   ADCHS_ADCTRG1_TRGSRC0_EVSYS_36_Val  _U_(0x5)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_5  */
#define   ADCHS_ADCTRG1_TRGSRC0_INT0_Val      _U_(0x4)                                             /**< (ADCHS_ADCTRG1) INT0  */
#define   ADCHS_ADCTRG1_TRGSRC0_SCAN_TRIG_Val _U_(0x3)                                             /**< (ADCHS_ADCTRG1) Scan trigger  */
#define   ADCHS_ADCTRG1_TRGSRC0_SW_LVL_Val    _U_(0x2)                                             /**< (ADCHS_ADCTRG1) Software level trigger  */
#define   ADCHS_ADCTRG1_TRGSRC0_SW_EDGE_Val   _U_(0x1)                                             /**< (ADCHS_ADCTRG1) Software edge trigger  */
#define   ADCHS_ADCTRG1_TRGSRC0_NONE_Val      _U_(0x0)                                             /**< (ADCHS_ADCTRG1) No Trigger  */
#define ADCHS_ADCTRG1_TRGSRC0_RESERVED        (ADCHS_ADCTRG1_TRGSRC0_RESERVED_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) RESERVED Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_47        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_47_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_16 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_46        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_46_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_15 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_45        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_45_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_14 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_44        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_44_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_13 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_43        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_43_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_12 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_42        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_42_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_11 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_41        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_41_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_10 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_40        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_40_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_9 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_39        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_39_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_8 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_38        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_38_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_7 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_37        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_37_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_6 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_EVSYS_36        (ADCHS_ADCTRG1_TRGSRC0_EVSYS_36_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_5 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_INT0            (ADCHS_ADCTRG1_TRGSRC0_INT0_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) INT0 Position  */
#define ADCHS_ADCTRG1_TRGSRC0_SCAN_TRIG       (ADCHS_ADCTRG1_TRGSRC0_SCAN_TRIG_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) Scan trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC0_SW_LVL          (ADCHS_ADCTRG1_TRGSRC0_SW_LVL_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) Software level trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC0_SW_EDGE         (ADCHS_ADCTRG1_TRGSRC0_SW_EDGE_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) Software edge trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC0_NONE            (ADCHS_ADCTRG1_TRGSRC0_NONE_Val << ADCHS_ADCTRG1_TRGSRC0_Pos) /**< (ADCHS_ADCTRG1) No Trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC1_Pos             _U_(8)                                               /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC1 Module Select bits Position */
#define ADCHS_ADCTRG1_TRGSRC1_Msk             (_U_(0x1F) << ADCHS_ADCTRG1_TRGSRC1_Pos)             /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC1 Module Select bits Mask */
#define ADCHS_ADCTRG1_TRGSRC1(value)          (ADCHS_ADCTRG1_TRGSRC1_Msk & ((value) << ADCHS_ADCTRG1_TRGSRC1_Pos))
#define   ADCHS_ADCTRG1_TRGSRC1_RESERVED_Val  _U_(0x1F)                                            /**< (ADCHS_ADCTRG1) RESERVED  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_47_Val  _U_(0x10)                                            /**< (ADCHS_ADCTRG1) ADC_TRIG_16  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_46_Val  _U_(0xF)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_15  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_45_Val  _U_(0xE)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_14  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_44_Val  _U_(0xD)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_13  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_43_Val  _U_(0xC)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_12  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_42_Val  _U_(0xB)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_11  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_41_Val  _U_(0xA)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_10  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_40_Val  _U_(0x9)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_9  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_39_Val  _U_(0x8)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_8  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_38_Val  _U_(0x7)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_7  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_37_Val  _U_(0x6)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_6  */
#define   ADCHS_ADCTRG1_TRGSRC1_EVSYS_36_Val  _U_(0x5)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_5  */
#define   ADCHS_ADCTRG1_TRGSRC1_INT0_Val      _U_(0x4)                                             /**< (ADCHS_ADCTRG1) INT0  */
#define   ADCHS_ADCTRG1_TRGSRC1_SCAN_TRIG_Val _U_(0x3)                                             /**< (ADCHS_ADCTRG1) Scan trigger  */
#define   ADCHS_ADCTRG1_TRGSRC1_SW_LVL_Val    _U_(0x2)                                             /**< (ADCHS_ADCTRG1) Software level trigger  */
#define   ADCHS_ADCTRG1_TRGSRC1_SW_EDGE_Val   _U_(0x1)                                             /**< (ADCHS_ADCTRG1) Software edge trigger  */
#define   ADCHS_ADCTRG1_TRGSRC1_NONE_Val      _U_(0x0)                                             /**< (ADCHS_ADCTRG1) No Trigger  */
#define ADCHS_ADCTRG1_TRGSRC1_RESERVED        (ADCHS_ADCTRG1_TRGSRC1_RESERVED_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) RESERVED Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_47        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_47_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_16 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_46        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_46_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_15 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_45        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_45_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_14 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_44        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_44_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_13 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_43        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_43_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_12 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_42        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_42_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_11 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_41        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_41_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_10 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_40        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_40_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_9 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_39        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_39_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_8 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_38        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_38_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_7 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_37        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_37_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_6 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_EVSYS_36        (ADCHS_ADCTRG1_TRGSRC1_EVSYS_36_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_5 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_INT0            (ADCHS_ADCTRG1_TRGSRC1_INT0_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) INT0 Position  */
#define ADCHS_ADCTRG1_TRGSRC1_SCAN_TRIG       (ADCHS_ADCTRG1_TRGSRC1_SCAN_TRIG_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) Scan trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC1_SW_LVL          (ADCHS_ADCTRG1_TRGSRC1_SW_LVL_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) Software level trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC1_SW_EDGE         (ADCHS_ADCTRG1_TRGSRC1_SW_EDGE_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) Software edge trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC1_NONE            (ADCHS_ADCTRG1_TRGSRC1_NONE_Val << ADCHS_ADCTRG1_TRGSRC1_Pos) /**< (ADCHS_ADCTRG1) No Trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC2_Pos             _U_(16)                                              /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC2 Module Select bits Position */
#define ADCHS_ADCTRG1_TRGSRC2_Msk             (_U_(0x1F) << ADCHS_ADCTRG1_TRGSRC2_Pos)             /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC2 Module Select bits Mask */
#define ADCHS_ADCTRG1_TRGSRC2(value)          (ADCHS_ADCTRG1_TRGSRC2_Msk & ((value) << ADCHS_ADCTRG1_TRGSRC2_Pos))
#define   ADCHS_ADCTRG1_TRGSRC2_RESERVED_Val  _U_(0x1F)                                            /**< (ADCHS_ADCTRG1) RESERVED  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_47_Val  _U_(0x10)                                            /**< (ADCHS_ADCTRG1) ADC_TRIG_16  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_46_Val  _U_(0xF)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_15  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_45_Val  _U_(0xE)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_14  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_44_Val  _U_(0xD)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_13  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_43_Val  _U_(0xC)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_12  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_42_Val  _U_(0xB)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_11  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_41_Val  _U_(0xA)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_10  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_40_Val  _U_(0x9)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_9  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_39_Val  _U_(0x8)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_8  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_38_Val  _U_(0x7)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_7  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_37_Val  _U_(0x6)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_6  */
#define   ADCHS_ADCTRG1_TRGSRC2_EVSYS_36_Val  _U_(0x5)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_5  */
#define   ADCHS_ADCTRG1_TRGSRC2_INT0_Val      _U_(0x4)                                             /**< (ADCHS_ADCTRG1) INT0  */
#define   ADCHS_ADCTRG1_TRGSRC2_SCAN_TRIG_Val _U_(0x3)                                             /**< (ADCHS_ADCTRG1) Scan trigger  */
#define   ADCHS_ADCTRG1_TRGSRC2_SW_LVL_Val    _U_(0x2)                                             /**< (ADCHS_ADCTRG1) Software level trigger  */
#define   ADCHS_ADCTRG1_TRGSRC2_SW_EDGE_Val   _U_(0x1)                                             /**< (ADCHS_ADCTRG1) Software edge trigger  */
#define   ADCHS_ADCTRG1_TRGSRC2_NONE_Val      _U_(0x0)                                             /**< (ADCHS_ADCTRG1) No Trigger  */
#define ADCHS_ADCTRG1_TRGSRC2_RESERVED        (ADCHS_ADCTRG1_TRGSRC2_RESERVED_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) RESERVED Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_47        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_47_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_16 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_46        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_46_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_15 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_45        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_45_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_14 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_44        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_44_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_13 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_43        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_43_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_12 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_42        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_42_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_11 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_41        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_41_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_10 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_40        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_40_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_9 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_39        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_39_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_8 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_38        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_38_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_7 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_37        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_37_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_6 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_EVSYS_36        (ADCHS_ADCTRG1_TRGSRC2_EVSYS_36_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_5 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_INT0            (ADCHS_ADCTRG1_TRGSRC2_INT0_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) INT0 Position  */
#define ADCHS_ADCTRG1_TRGSRC2_SCAN_TRIG       (ADCHS_ADCTRG1_TRGSRC2_SCAN_TRIG_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) Scan trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC2_SW_LVL          (ADCHS_ADCTRG1_TRGSRC2_SW_LVL_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) Software level trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC2_SW_EDGE         (ADCHS_ADCTRG1_TRGSRC2_SW_EDGE_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) Software edge trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC2_NONE            (ADCHS_ADCTRG1_TRGSRC2_NONE_Val << ADCHS_ADCTRG1_TRGSRC2_Pos) /**< (ADCHS_ADCTRG1) No Trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC3_Pos             _U_(24)                                              /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC3 Module Select bits Position */
#define ADCHS_ADCTRG1_TRGSRC3_Msk             (_U_(0x1F) << ADCHS_ADCTRG1_TRGSRC3_Pos)             /**< (ADCHS_ADCTRG1) Trigger Source for Conversion of ADC3 Module Select bits Mask */
#define ADCHS_ADCTRG1_TRGSRC3(value)          (ADCHS_ADCTRG1_TRGSRC3_Msk & ((value) << ADCHS_ADCTRG1_TRGSRC3_Pos))
#define   ADCHS_ADCTRG1_TRGSRC3_RESERVED_Val  _U_(0x1F)                                            /**< (ADCHS_ADCTRG1) RESERVED  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_47_Val  _U_(0x10)                                            /**< (ADCHS_ADCTRG1) ADC_TRIG_16  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_46_Val  _U_(0xF)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_15  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_45_Val  _U_(0xE)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_14  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_44_Val  _U_(0xD)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_13  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_43_Val  _U_(0xC)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_12  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_42_Val  _U_(0xB)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_11  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_41_Val  _U_(0xA)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_10  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_40_Val  _U_(0x9)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_9  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_39_Val  _U_(0x8)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_8  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_38_Val  _U_(0x7)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_7  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_37_Val  _U_(0x6)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_6  */
#define   ADCHS_ADCTRG1_TRGSRC3_EVSYS_36_Val  _U_(0x5)                                             /**< (ADCHS_ADCTRG1) ADC_TRIG_5  */
#define   ADCHS_ADCTRG1_TRGSRC3_INT0_Val      _U_(0x4)                                             /**< (ADCHS_ADCTRG1) INT0  */
#define   ADCHS_ADCTRG1_TRGSRC3_SCAN_TRIG_Val _U_(0x3)                                             /**< (ADCHS_ADCTRG1) Scan trigger  */
#define   ADCHS_ADCTRG1_TRGSRC3_SW_LVL_Val    _U_(0x2)                                             /**< (ADCHS_ADCTRG1) Software level trigger  */
#define   ADCHS_ADCTRG1_TRGSRC3_SW_EDGE_Val   _U_(0x1)                                             /**< (ADCHS_ADCTRG1) Software edge trigger  */
#define   ADCHS_ADCTRG1_TRGSRC3_NONE_Val      _U_(0x0)                                             /**< (ADCHS_ADCTRG1) No Trigger  */
#define ADCHS_ADCTRG1_TRGSRC3_RESERVED        (ADCHS_ADCTRG1_TRGSRC3_RESERVED_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) RESERVED Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_47        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_47_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_16 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_46        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_46_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_15 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_45        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_45_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_14 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_44        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_44_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_13 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_43        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_43_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_12 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_42        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_42_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_11 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_41        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_41_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_10 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_40        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_40_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_9 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_39        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_39_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_8 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_38        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_38_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_7 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_37        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_37_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_6 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_EVSYS_36        (ADCHS_ADCTRG1_TRGSRC3_EVSYS_36_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) ADC_TRIG_5 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_INT0            (ADCHS_ADCTRG1_TRGSRC3_INT0_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) INT0 Position  */
#define ADCHS_ADCTRG1_TRGSRC3_SCAN_TRIG       (ADCHS_ADCTRG1_TRGSRC3_SCAN_TRIG_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) Scan trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC3_SW_LVL          (ADCHS_ADCTRG1_TRGSRC3_SW_LVL_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) Software level trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC3_SW_EDGE         (ADCHS_ADCTRG1_TRGSRC3_SW_EDGE_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) Software edge trigger Position  */
#define ADCHS_ADCTRG1_TRGSRC3_NONE            (ADCHS_ADCTRG1_TRGSRC3_NONE_Val << ADCHS_ADCTRG1_TRGSRC3_Pos) /**< (ADCHS_ADCTRG1) No Trigger Position  */
#define ADCHS_ADCTRG1_Msk                     _U_(0x1F1F1F1F)                                      /**< (ADCHS_ADCTRG1) Register Mask  */


/* -------- ADCHS_ADCTRG2 : (ADCHS Offset: 0x210) (R/W 32) ADC Trigger Source 2 Register -------- */
#define ADCHS_ADCTRG2_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCTRG2) ADC Trigger Source 2 Register  Reset Value */

