Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCTRG2_TRGSRC4_Pos             _U_(0)                                               /**< (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC4 Module Select bits Position */
#define ADCHS_ADCTRG2_TRGSRC4_Msk             (_U_(0x1F) << ADCHS_ADCTRG2_TRGSRC4_Pos)             /**< (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC4 Module Select bits Mask */
#define ADCHS_ADCTRG2_TRGSRC4(value)          (ADCHS_ADCTRG2_TRGSRC4_Msk & ((value) << ADCHS_ADCTRG2_TRGSRC4_Pos))
#define   ADCHS_ADCTRG2_TRGSRC4_RESERVED_Val  _U_(0x1F)                                            /**< (ADCHS_ADCTRG2) RESERVED  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_47_Val  _U_(0x10)                                            /**< (ADCHS_ADCTRG2) ADC_TRIG_16  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_46_Val  _U_(0xF)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_15  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_45_Val  _U_(0xE)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_14  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_44_Val  _U_(0xD)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_13  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_43_Val  _U_(0xC)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_12  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_42_Val  _U_(0xB)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_11  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_41_Val  _U_(0xA)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_10  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_40_Val  _U_(0x9)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_9  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_39_Val  _U_(0x8)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_8  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_38_Val  _U_(0x7)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_7  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_37_Val  _U_(0x6)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_6  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_36_Val  _U_(0x5)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_5  */
#define   ADCHS_ADCTRG2_TRGSRC4_INT0_Val      _U_(0x4)                                             /**< (ADCHS_ADCTRG2) INT0  */
#define   ADCHS_ADCTRG2_TRGSRC4_SCAN_TRIG_Val _U_(0x3)                                             /**< (ADCHS_ADCTRG2) Scan trigger  */
#define   ADCHS_ADCTRG2_TRGSRC4_SW_LVL_Val    _U_(0x2)                                             /**< (ADCHS_ADCTRG2) Software level trigger  */
#define   ADCHS_ADCTRG2_TRGSRC4_SW_EDGE_Val   _U_(0x1)                                             /**< (ADCHS_ADCTRG2) Software edge trigger  */
#define   ADCHS_ADCTRG2_TRGSRC4_NONE_Val      _U_(0x0)                                             /**< (ADCHS_ADCTRG2) No Trigger  */
#define ADCHS_ADCTRG2_TRGSRC4_RESERVED        (ADCHS_ADCTRG2_TRGSRC4_RESERVED_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) RESERVED Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_47        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_47_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_16 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_46        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_46_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_15 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_45        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_45_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_14 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_44        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_44_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_13 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_43        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_43_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_12 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_42        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_42_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_11 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_41        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_41_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_10 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_40        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_40_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_9 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_39        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_39_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_8 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_38        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_38_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_7 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_37        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_37_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_6 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_36        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_36_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_5 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_INT0            (ADCHS_ADCTRG2_TRGSRC4_INT0_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) INT0 Position  */
#define ADCHS_ADCTRG2_TRGSRC4_SCAN_TRIG       (ADCHS_ADCTRG2_TRGSRC4_SCAN_TRIG_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) Scan trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC4_SW_LVL          (ADCHS_ADCTRG2_TRGSRC4_SW_LVL_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) Software level trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC4_SW_EDGE         (ADCHS_ADCTRG2_TRGSRC4_SW_EDGE_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) Software edge trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC4_NONE            (ADCHS_ADCTRG2_TRGSRC4_NONE_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /**< (ADCHS_ADCTRG2) No Trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC5_Pos             _U_(8)                                               /**< (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC5 Module Select bits Position */
#define ADCHS_ADCTRG2_TRGSRC5_Msk             (_U_(0x1F) << ADCHS_ADCTRG2_TRGSRC5_Pos)             /**< (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC5 Module Select bits Mask */
#define ADCHS_ADCTRG2_TRGSRC5(value)          (ADCHS_ADCTRG2_TRGSRC5_Msk & ((value) << ADCHS_ADCTRG2_TRGSRC5_Pos))
#define   ADCHS_ADCTRG2_TRGSRC5_RESERVED_Val  _U_(0x1F)                                            /**< (ADCHS_ADCTRG2) RESERVED  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_47_Val  _U_(0x10)                                            /**< (ADCHS_ADCTRG2) ADC_TRIG_16  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_46_Val  _U_(0xF)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_15  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_45_Val  _U_(0xE)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_14  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_44_Val  _U_(0xD)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_13  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_43_Val  _U_(0xC)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_12  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_42_Val  _U_(0xB)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_11  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_41_Val  _U_(0xA)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_10  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_40_Val  _U_(0x9)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_9  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_39_Val  _U_(0x8)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_8  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_38_Val  _U_(0x7)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_7  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_37_Val  _U_(0x6)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_6  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_36_Val  _U_(0x5)                                             /**< (ADCHS_ADCTRG2) ADC_TRIG_5  */
#define   ADCHS_ADCTRG2_TRGSRC5_INT0_Val      _U_(0x4)                                             /**< (ADCHS_ADCTRG2) INT0  */
#define   ADCHS_ADCTRG2_TRGSRC5_SCAN_TRIG_Val _U_(0x3)                                             /**< (ADCHS_ADCTRG2) Scan trigger  */
#define   ADCHS_ADCTRG2_TRGSRC5_SW_LVL_Val    _U_(0x2)                                             /**< (ADCHS_ADCTRG2) Software level trigger  */
#define   ADCHS_ADCTRG2_TRGSRC5_SW_EDGE_Val   _U_(0x1)                                             /**< (ADCHS_ADCTRG2) Software edge trigger  */
#define   ADCHS_ADCTRG2_TRGSRC5_NONE_Val      _U_(0x0)                                             /**< (ADCHS_ADCTRG2) No Trigger  */
#define ADCHS_ADCTRG2_TRGSRC5_RESERVED        (ADCHS_ADCTRG2_TRGSRC5_RESERVED_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) RESERVED Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_47        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_47_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_16 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_46        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_46_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_15 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_45        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_45_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_14 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_44        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_44_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_13 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_43        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_43_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_12 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_42        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_42_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_11 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_41        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_41_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_10 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_40        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_40_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_9 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_39        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_39_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_8 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_38        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_38_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_7 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_37        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_37_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_6 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_36        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_36_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) ADC_TRIG_5 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_INT0            (ADCHS_ADCTRG2_TRGSRC5_INT0_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) INT0 Position  */
#define ADCHS_ADCTRG2_TRGSRC5_SCAN_TRIG       (ADCHS_ADCTRG2_TRGSRC5_SCAN_TRIG_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) Scan trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC5_SW_LVL          (ADCHS_ADCTRG2_TRGSRC5_SW_LVL_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) Software level trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC5_SW_EDGE         (ADCHS_ADCTRG2_TRGSRC5_SW_EDGE_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) Software edge trigger Position  */
#define ADCHS_ADCTRG2_TRGSRC5_NONE            (ADCHS_ADCTRG2_TRGSRC5_NONE_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /**< (ADCHS_ADCTRG2) No Trigger Position  */
#define ADCHS_ADCTRG2_Msk                     _U_(0x00001F1F)                                      /**< (ADCHS_ADCTRG2) Register Mask  */


/* -------- ADCHS_ADCCMPCON1 : (ADCHS Offset: 0x280) (R/W 32)  -------- */
#define ADCHS_ADCCMPCON1_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCMPCON1)   Reset Value */

#define ADCHS_ADCCMPCON1_IELOLO_Pos           _U_(0)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IELOLO_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_IELOLO_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IELOLO(value)        (ADCHS_ADCCMPCON1_IELOLO_Msk & ((value) << ADCHS_ADCCMPCON1_IELOLO_Pos))
#define ADCHS_ADCCMPCON1_IELOHI_Pos           _U_(1)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IELOHI_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_IELOHI_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IELOHI(value)        (ADCHS_ADCCMPCON1_IELOHI_Msk & ((value) << ADCHS_ADCCMPCON1_IELOHI_Pos))
#define ADCHS_ADCCMPCON1_IEHILO_Pos           _U_(2)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IEHILO_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_IEHILO_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IEHILO(value)        (ADCHS_ADCCMPCON1_IEHILO_Msk & ((value) << ADCHS_ADCCMPCON1_IEHILO_Pos))
#define ADCHS_ADCCMPCON1_IEHIHI_Pos           _U_(3)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IEHIHI_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_IEHIHI_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IEHIHI(value)        (ADCHS_ADCCMPCON1_IEHIHI_Msk & ((value) << ADCHS_ADCCMPCON1_IEHIHI_Pos))
#define ADCHS_ADCCMPCON1_IEBTWN_Pos           _U_(4)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IEBTWN_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_IEBTWN_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IEBTWN(value)        (ADCHS_ADCCMPCON1_IEBTWN_Msk & ((value) << ADCHS_ADCCMPCON1_IEBTWN_Pos))
#define ADCHS_ADCCMPCON1_DCMPED_Pos           _U_(5)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_DCMPED_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_DCMPED_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_DCMPED(value)        (ADCHS_ADCCMPCON1_DCMPED_Msk & ((value) << ADCHS_ADCCMPCON1_DCMPED_Pos))
#define ADCHS_ADCCMPCON1_DCMPIEN_Pos          _U_(6)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_DCMPIEN_Msk          (_U_(0x1) << ADCHS_ADCCMPCON1_DCMPIEN_Pos)           /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_DCMPIEN(value)       (ADCHS_ADCCMPCON1_DCMPIEN_Msk & ((value) << ADCHS_ADCCMPCON1_DCMPIEN_Pos))
#define ADCHS_ADCCMPCON1_ENDCMP_Pos           _U_(7)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_ENDCMP_Msk           (_U_(0x1) << ADCHS_ADCCMPCON1_ENDCMP_Pos)            /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_ENDCMP(value)        (ADCHS_ADCCMPCON1_ENDCMP_Msk & ((value) << ADCHS_ADCCMPCON1_ENDCMP_Pos))
#define ADCHS_ADCCMPCON1_CMPINID0_Pos         _U_(8)                                               /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_CMPINID0_Msk         (_U_(0x3F) << ADCHS_ADCCMPCON1_CMPINID0_Pos)         /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_CMPINID0(value)      (ADCHS_ADCCMPCON1_CMPINID0_Msk & ((value) << ADCHS_ADCCMPCON1_CMPINID0_Pos))
#define ADCHS_ADCCMPCON1_CVD_DATA_Pos         _U_(16)                                              /**< (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_CVD_DATA_Msk         (_U_(0xFFFF) << ADCHS_ADCCMPCON1_CVD_DATA_Pos)       /**< (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_CVD_DATA(value)      (ADCHS_ADCCMPCON1_CVD_DATA_Msk & ((value) << ADCHS_ADCCMPCON1_CVD_DATA_Pos))
#define ADCHS_ADCCMPCON1_Msk                  _U_(0xFFFF3FFF)                                      /**< (ADCHS_ADCCMPCON1) Register Mask  */


/* -------- ADCHS_ADCCMPCON2 : (ADCHS Offset: 0x290) (R/W 32)  -------- */
#define ADCHS_ADCCMPCON2_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCMPCON2)   Reset Value */

#define ADCHS_ADCCMPCON2_IELOLO_Pos           _U_(0)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IELOLO_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_IELOLO_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IELOLO(value)        (ADCHS_ADCCMPCON2_IELOLO_Msk & ((value) << ADCHS_ADCCMPCON2_IELOLO_Pos))
#define ADCHS_ADCCMPCON2_IELOHI_Pos           _U_(1)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IELOHI_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_IELOHI_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IELOHI(value)        (ADCHS_ADCCMPCON2_IELOHI_Msk & ((value) << ADCHS_ADCCMPCON2_IELOHI_Pos))
#define ADCHS_ADCCMPCON2_IEHILO_Pos           _U_(2)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IEHILO_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_IEHILO_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IEHILO(value)        (ADCHS_ADCCMPCON2_IEHILO_Msk & ((value) << ADCHS_ADCCMPCON2_IEHILO_Pos))
#define ADCHS_ADCCMPCON2_IEHIHI_Pos           _U_(3)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IEHIHI_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_IEHIHI_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IEHIHI(value)        (ADCHS_ADCCMPCON2_IEHIHI_Msk & ((value) << ADCHS_ADCCMPCON2_IEHIHI_Pos))
#define ADCHS_ADCCMPCON2_IEBTWN_Pos           _U_(4)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IEBTWN_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_IEBTWN_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IEBTWN(value)        (ADCHS_ADCCMPCON2_IEBTWN_Msk & ((value) << ADCHS_ADCCMPCON2_IEBTWN_Pos))
#define ADCHS_ADCCMPCON2_DCMPED_Pos           _U_(5)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_DCMPED_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_DCMPED_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_DCMPED(value)        (ADCHS_ADCCMPCON2_DCMPED_Msk & ((value) << ADCHS_ADCCMPCON2_DCMPED_Pos))
#define ADCHS_ADCCMPCON2_DCMPGIEN_Pos         _U_(6)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_DCMPGIEN_Msk         (_U_(0x1) << ADCHS_ADCCMPCON2_DCMPGIEN_Pos)          /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_DCMPGIEN(value)      (ADCHS_ADCCMPCON2_DCMPGIEN_Msk & ((value) << ADCHS_ADCCMPCON2_DCMPGIEN_Pos))
#define ADCHS_ADCCMPCON2_ENDCMP_Pos           _U_(7)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_ENDCMP_Msk           (_U_(0x1) << ADCHS_ADCCMPCON2_ENDCMP_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_ENDCMP(value)        (ADCHS_ADCCMPCON2_ENDCMP_Msk & ((value) << ADCHS_ADCCMPCON2_ENDCMP_Pos))
#define ADCHS_ADCCMPCON2_AINID_Pos            _U_(8)                                               /**< (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_AINID_Msk            (_U_(0x1F) << ADCHS_ADCCMPCON2_AINID_Pos)            /**< (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_AINID(value)         (ADCHS_ADCCMPCON2_AINID_Msk & ((value) << ADCHS_ADCCMPCON2_AINID_Pos))
#define ADCHS_ADCCMPCON2_Msk                  _U_(0x00001FFF)                                      /**< (ADCHS_ADCCMPCON2) Register Mask  */


/* -------- ADCHS_ADCBASE : (ADCHS Offset: 0x300) (R/W 32)  -------- */
#define ADCHS_ADCBASE_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCBASE)   Reset Value */

