Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCBASE_ADCBASE_Pos             _U_(0)                                               /**< (ADCHS_ADCBASE)  Position */
#define ADCHS_ADCBASE_ADCBASE_Msk             (_U_(0xFFFF) << ADCHS_ADCBASE_ADCBASE_Pos)           /**< (ADCHS_ADCBASE)  Mask */
#define ADCHS_ADCBASE_ADCBASE(value)          (ADCHS_ADCBASE_ADCBASE_Msk & ((value) << ADCHS_ADCBASE_ADCBASE_Pos))
#define ADCHS_ADCBASE_Msk                     _U_(0x0000FFFF)                                      /**< (ADCHS_ADCBASE) Register Mask  */


/* -------- ADCHS_ADCDMASTAT : (ADCHS Offset: 0x310) (R/W 32)  -------- */
#define ADCHS_ADCDMASTAT_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCDMASTAT)   Reset Value */

#define ADCHS_ADCDMASTAT_RAF0_Pos             _U_(0)                                               /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RAF0_Msk             (_U_(0x1) << ADCHS_ADCDMASTAT_RAF0_Pos)              /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RAF0(value)          (ADCHS_ADCDMASTAT_RAF0_Msk & ((value) << ADCHS_ADCDMASTAT_RAF0_Pos))
#define ADCHS_ADCDMASTAT_RAF_IEN0_Pos         _U_(8)                                               /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RAF_IEN0_Msk         (_U_(0x1) << ADCHS_ADCDMASTAT_RAF_IEN0_Pos)          /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RAF_IEN0(value)      (ADCHS_ADCDMASTAT_RAF_IEN0_Msk & ((value) << ADCHS_ADCDMASTAT_RAF_IEN0_Pos))
#define ADCHS_ADCDMASTAT_DMA_CNT_EN_Pos       _U_(15)                                              /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_DMA_CNT_EN_Msk       (_U_(0x1) << ADCHS_ADCDMASTAT_DMA_CNT_EN_Pos)        /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_DMA_CNT_EN(value)    (ADCHS_ADCDMASTAT_DMA_CNT_EN_Msk & ((value) << ADCHS_ADCDMASTAT_DMA_CNT_EN_Pos))
#define ADCHS_ADCDMASTAT_RBF0_Pos             _U_(16)                                              /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RBF0_Msk             (_U_(0x1) << ADCHS_ADCDMASTAT_RBF0_Pos)              /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RBF0(value)          (ADCHS_ADCDMASTAT_RBF0_Msk & ((value) << ADCHS_ADCDMASTAT_RBF0_Pos))
#define ADCHS_ADCDMASTAT_WR_OVF_ERR_Pos       _U_(23)                                              /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_WR_OVF_ERR_Msk       (_U_(0x1) << ADCHS_ADCDMASTAT_WR_OVF_ERR_Pos)        /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_WR_OVF_ERR(value)    (ADCHS_ADCDMASTAT_WR_OVF_ERR_Msk & ((value) << ADCHS_ADCDMASTAT_WR_OVF_ERR_Pos))
#define ADCHS_ADCDMASTAT_RBF_IEN0_Pos         _U_(24)                                              /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RBF_IEN0_Msk         (_U_(0x1) << ADCHS_ADCDMASTAT_RBF_IEN0_Pos)          /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RBF_IEN0(value)      (ADCHS_ADCDMASTAT_RBF_IEN0_Msk & ((value) << ADCHS_ADCDMASTAT_RBF_IEN0_Pos))
#define ADCHS_ADCDMASTAT_DMAEN_Pos            _U_(31)                                              /**< (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_DMAEN_Msk            (_U_(0x1) << ADCHS_ADCDMASTAT_DMAEN_Pos)             /**< (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_DMAEN(value)         (ADCHS_ADCDMASTAT_DMAEN_Msk & ((value) << ADCHS_ADCDMASTAT_DMAEN_Pos))
#define ADCHS_ADCDMASTAT_Msk                  _U_(0x81818101)                                      /**< (ADCHS_ADCDMASTAT) Register Mask  */

#define ADCHS_ADCDMASTAT_RAF_Pos              _U_(0)                                               /**< (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RAF_Msk              (_U_(0x1) << ADCHS_ADCDMASTAT_RAF_Pos)               /**< (ADCHS_ADCDMASTAT Mask) RAF */
#define ADCHS_ADCDMASTAT_RAF(value)           (ADCHS_ADCDMASTAT_RAF_Msk & ((value) << ADCHS_ADCDMASTAT_RAF_Pos)) 
#define ADCHS_ADCDMASTAT_RAF_IEN_Pos          _U_(8)                                               /**< (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RAF_IEN_Msk          (_U_(0x1) << ADCHS_ADCDMASTAT_RAF_IEN_Pos)           /**< (ADCHS_ADCDMASTAT Mask) RAF_IEN */
#define ADCHS_ADCDMASTAT_RAF_IEN(value)       (ADCHS_ADCDMASTAT_RAF_IEN_Msk & ((value) << ADCHS_ADCDMASTAT_RAF_IEN_Pos)) 
#define ADCHS_ADCDMASTAT_RBF_Pos              _U_(16)                                              /**< (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RBF_Msk              (_U_(0x1) << ADCHS_ADCDMASTAT_RBF_Pos)               /**< (ADCHS_ADCDMASTAT Mask) RBF */
#define ADCHS_ADCDMASTAT_RBF(value)           (ADCHS_ADCDMASTAT_RBF_Msk & ((value) << ADCHS_ADCDMASTAT_RBF_Pos)) 
#define ADCHS_ADCDMASTAT_RBF_IEN_Pos          _U_(24)                                              /**< (ADCHS_ADCDMASTAT Position)  */
#define ADCHS_ADCDMASTAT_RBF_IEN_Msk          (_U_(0x1) << ADCHS_ADCDMASTAT_RBF_IEN_Pos)           /**< (ADCHS_ADCDMASTAT Mask) RBF_IEN */
#define ADCHS_ADCDMASTAT_RBF_IEN(value)       (ADCHS_ADCDMASTAT_RBF_IEN_Msk & ((value) << ADCHS_ADCDMASTAT_RBF_IEN_Pos)) 

/* -------- ADCHS_ADCCNTB : (ADCHS Offset: 0x320) (R/W 32)  -------- */
#define ADCHS_ADCCNTB_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCCNTB)   Reset Value */

#define ADCHS_ADCCNTB_ADCCNTB_Pos             _U_(0)                                               /**< (ADCHS_ADCCNTB)  Position */
#define ADCHS_ADCCNTB_ADCCNTB_Msk             (_U_(0xFFFFFFFF) << ADCHS_ADCCNTB_ADCCNTB_Pos)       /**< (ADCHS_ADCCNTB)  Mask */
#define ADCHS_ADCCNTB_ADCCNTB(value)          (ADCHS_ADCCNTB_ADCCNTB_Msk & ((value) << ADCHS_ADCCNTB_ADCCNTB_Pos))
#define ADCHS_ADCCNTB_Msk                     _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCCNTB) Register Mask  */


/* -------- ADCHS_ADCDMAB : (ADCHS Offset: 0x330) (R/W 32)  -------- */
#define ADCHS_ADCDMAB_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADCDMAB)   Reset Value */

