Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCDMAB_ADDMAB_Pos              _U_(0)                                               /**< (ADCHS_ADCDMAB)  Position */
#define ADCHS_ADCDMAB_ADDMAB_Msk              (_U_(0xFFFFFFFF) << ADCHS_ADCDMAB_ADDMAB_Pos)        /**< (ADCHS_ADCDMAB)  Mask */
#define ADCHS_ADCDMAB_ADDMAB(value)           (ADCHS_ADCDMAB_ADDMAB_Msk & ((value) << ADCHS_ADCDMAB_ADDMAB_Pos))
#define ADCHS_ADCDMAB_Msk                     _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDMAB) Register Mask  */


/* -------- ADCHS_ADCTRGSNS : (ADCHS Offset: 0x340) (R/W 32)  -------- */
#define ADCHS_ADCTRGSNS_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADCTRGSNS)   Reset Value */

#define ADCHS_ADCTRGSNS_LVL0_Pos              _U_(0)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL0_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL0_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL0(value)           (ADCHS_ADCTRGSNS_LVL0_Msk & ((value) << ADCHS_ADCTRGSNS_LVL0_Pos))
#define ADCHS_ADCTRGSNS_LVL1_Pos              _U_(1)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL1_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL1_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL1(value)           (ADCHS_ADCTRGSNS_LVL1_Msk & ((value) << ADCHS_ADCTRGSNS_LVL1_Pos))
#define ADCHS_ADCTRGSNS_LVL2_Pos              _U_(2)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL2_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL2_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL2(value)           (ADCHS_ADCTRGSNS_LVL2_Msk & ((value) << ADCHS_ADCTRGSNS_LVL2_Pos))
#define ADCHS_ADCTRGSNS_LVL3_Pos              _U_(3)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL3_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL3_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL3(value)           (ADCHS_ADCTRGSNS_LVL3_Msk & ((value) << ADCHS_ADCTRGSNS_LVL3_Pos))
#define ADCHS_ADCTRGSNS_LVL4_Pos              _U_(4)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL4_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL4_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL4(value)           (ADCHS_ADCTRGSNS_LVL4_Msk & ((value) << ADCHS_ADCTRGSNS_LVL4_Pos))
#define ADCHS_ADCTRGSNS_LVL5_Pos              _U_(5)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL5_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL5_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL5(value)           (ADCHS_ADCTRGSNS_LVL5_Msk & ((value) << ADCHS_ADCTRGSNS_LVL5_Pos))
#define ADCHS_ADCTRGSNS_LVL6_Pos              _U_(6)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL6_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL6_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL6(value)           (ADCHS_ADCTRGSNS_LVL6_Msk & ((value) << ADCHS_ADCTRGSNS_LVL6_Pos))
#define ADCHS_ADCTRGSNS_LVL7_Pos              _U_(7)                                               /**< (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL7_Msk              (_U_(0x1) << ADCHS_ADCTRGSNS_LVL7_Pos)               /**< (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL7(value)           (ADCHS_ADCTRGSNS_LVL7_Msk & ((value) << ADCHS_ADCTRGSNS_LVL7_Pos))
#define ADCHS_ADCTRGSNS_Msk                   _U_(0x000000FF)                                      /**< (ADCHS_ADCTRGSNS) Register Mask  */

#define ADCHS_ADCTRGSNS_LVL_Pos               _U_(0)                                               /**< (ADCHS_ADCTRGSNS Position)  */
#define ADCHS_ADCTRGSNS_LVL_Msk               (_U_(0xFF) << ADCHS_ADCTRGSNS_LVL_Pos)               /**< (ADCHS_ADCTRGSNS Mask) LVL */
#define ADCHS_ADCTRGSNS_LVL(value)            (ADCHS_ADCTRGSNS_LVL_Msk & ((value) << ADCHS_ADCTRGSNS_LVL_Pos)) 

/* -------- ADCHS_ADCANCON : (ADCHS Offset: 0x400) (R/W 32)  -------- */
#define ADCHS_ADCANCON_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCANCON)   Reset Value */

#define ADCHS_ADCANCON_ANEN0_Pos              _U_(0)                                               /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_ANEN0_Msk              (_U_(0x1) << ADCHS_ADCANCON_ANEN0_Pos)               /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_ANEN0(value)           (ADCHS_ADCANCON_ANEN0_Msk & ((value) << ADCHS_ADCANCON_ANEN0_Pos))
#define ADCHS_ADCANCON_ANEN7_Pos              _U_(7)                                               /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_ANEN7_Msk              (_U_(0x1) << ADCHS_ADCANCON_ANEN7_Pos)               /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_ANEN7(value)           (ADCHS_ADCANCON_ANEN7_Msk & ((value) << ADCHS_ADCANCON_ANEN7_Pos))
#define ADCHS_ADCANCON_WKRDY0_Pos             _U_(8)                                               /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKRDY0_Msk             (_U_(0x1) << ADCHS_ADCANCON_WKRDY0_Pos)              /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKRDY0(value)          (ADCHS_ADCANCON_WKRDY0_Msk & ((value) << ADCHS_ADCANCON_WKRDY0_Pos))
#define ADCHS_ADCANCON_WKRDY7_Pos             _U_(15)                                              /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKRDY7_Msk             (_U_(0x1) << ADCHS_ADCANCON_WKRDY7_Pos)              /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKRDY7(value)          (ADCHS_ADCANCON_WKRDY7_Msk & ((value) << ADCHS_ADCANCON_WKRDY7_Pos))
#define ADCHS_ADCANCON_WKIEN0_Pos             _U_(16)                                              /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKIEN0_Msk             (_U_(0x1) << ADCHS_ADCANCON_WKIEN0_Pos)              /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKIEN0(value)          (ADCHS_ADCANCON_WKIEN0_Msk & ((value) << ADCHS_ADCANCON_WKIEN0_Pos))
#define ADCHS_ADCANCON_WKIEN7_Pos             _U_(23)                                              /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKIEN7_Msk             (_U_(0x1) << ADCHS_ADCANCON_WKIEN7_Pos)              /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKIEN7(value)          (ADCHS_ADCANCON_WKIEN7_Msk & ((value) << ADCHS_ADCANCON_WKIEN7_Pos))
#define ADCHS_ADCANCON_WKUPCLKCNT_Pos         _U_(24)                                              /**< (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKUPCLKCNT_Msk         (_U_(0xF) << ADCHS_ADCANCON_WKUPCLKCNT_Pos)          /**< (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKUPCLKCNT(value)      (ADCHS_ADCANCON_WKUPCLKCNT_Msk & ((value) << ADCHS_ADCANCON_WKUPCLKCNT_Pos))
#define ADCHS_ADCANCON_Msk                    _U_(0x0F818181)                                      /**< (ADCHS_ADCANCON) Register Mask  */

