Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCANCON_ANEN_Pos               _U_(0)                                               /**< (ADCHS_ADCANCON Position)  */
#define ADCHS_ADCANCON_ANEN_Msk               (_U_(0x3) << ADCHS_ADCANCON_ANEN_Pos)                /**< (ADCHS_ADCANCON Mask) ANEN */
#define ADCHS_ADCANCON_ANEN(value)            (ADCHS_ADCANCON_ANEN_Msk & ((value) << ADCHS_ADCANCON_ANEN_Pos)) 
#define ADCHS_ADCANCON_WKRDY_Pos              _U_(8)                                               /**< (ADCHS_ADCANCON Position)  */
#define ADCHS_ADCANCON_WKRDY_Msk              (_U_(0x3) << ADCHS_ADCANCON_WKRDY_Pos)               /**< (ADCHS_ADCANCON Mask) WKRDY */
#define ADCHS_ADCANCON_WKRDY(value)           (ADCHS_ADCANCON_WKRDY_Msk & ((value) << ADCHS_ADCANCON_WKRDY_Pos)) 
#define ADCHS_ADCANCON_WKIEN_Pos              _U_(16)                                              /**< (ADCHS_ADCANCON Position)  */
#define ADCHS_ADCANCON_WKIEN_Msk              (_U_(0x3) << ADCHS_ADCANCON_WKIEN_Pos)               /**< (ADCHS_ADCANCON Mask) WKIEN */
#define ADCHS_ADCANCON_WKIEN(value)           (ADCHS_ADCANCON_WKIEN_Msk & ((value) << ADCHS_ADCANCON_WKIEN_Pos)) 

/* -------- ADCHS_ADC7CFG : (ADCHS Offset: 0x670) (R/W 32)  -------- */
#define ADCHS_ADC7CFG_RESETVALUE              _U_(0x00)                                            /**<  (ADCHS_ADC7CFG)   Reset Value */

#define ADCHS_ADC7CFG_ADC7CFG_Pos             _U_(0)                                               /**< (ADCHS_ADC7CFG)  Position */
#define ADCHS_ADC7CFG_ADC7CFG_Msk             (_U_(0xFFFFFFFF) << ADCHS_ADC7CFG_ADC7CFG_Pos)       /**< (ADCHS_ADC7CFG)  Mask */
#define ADCHS_ADC7CFG_ADC7CFG(value)          (ADCHS_ADC7CFG_ADC7CFG_Msk & ((value) << ADCHS_ADC7CFG_ADC7CFG_Pos))
#define ADCHS_ADC7CFG_Msk                     _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADC7CFG) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0 : (ADCHS Offset: 0x700) (R/W 32)  -------- */
#define ADCHS_ADCSYSCFG0_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCSYSCFG0)   Reset Value */

#define ADCHS_ADCSYSCFG0_AN0_Pos              _U_(0)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN0_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN0_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN0(value)           (ADCHS_ADCSYSCFG0_AN0_Msk & ((value) << ADCHS_ADCSYSCFG0_AN0_Pos))
#define ADCHS_ADCSYSCFG0_AN1_Pos              _U_(1)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN1_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN1_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN1(value)           (ADCHS_ADCSYSCFG0_AN1_Msk & ((value) << ADCHS_ADCSYSCFG0_AN1_Pos))
#define ADCHS_ADCSYSCFG0_AN2_Pos              _U_(2)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN2_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN2_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN2(value)           (ADCHS_ADCSYSCFG0_AN2_Msk & ((value) << ADCHS_ADCSYSCFG0_AN2_Pos))
#define ADCHS_ADCSYSCFG0_AN3_Pos              _U_(3)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN3_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN3_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN3(value)           (ADCHS_ADCSYSCFG0_AN3_Msk & ((value) << ADCHS_ADCSYSCFG0_AN3_Pos))
#define ADCHS_ADCSYSCFG0_AN4_Pos              _U_(4)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN4_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN4_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN4(value)           (ADCHS_ADCSYSCFG0_AN4_Msk & ((value) << ADCHS_ADCSYSCFG0_AN4_Pos))
#define ADCHS_ADCSYSCFG0_AN5_Pos              _U_(5)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN5_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN5_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN5(value)           (ADCHS_ADCSYSCFG0_AN5_Msk & ((value) << ADCHS_ADCSYSCFG0_AN5_Pos))
#define ADCHS_ADCSYSCFG0_AN6_Pos              _U_(6)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN6_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN6_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN6(value)           (ADCHS_ADCSYSCFG0_AN6_Msk & ((value) << ADCHS_ADCSYSCFG0_AN6_Pos))
#define ADCHS_ADCSYSCFG0_AN7_Pos              _U_(7)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN7_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN7_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN7(value)           (ADCHS_ADCSYSCFG0_AN7_Msk & ((value) << ADCHS_ADCSYSCFG0_AN7_Pos))
#define ADCHS_ADCSYSCFG0_AN8_Pos              _U_(8)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN8_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN8_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN8(value)           (ADCHS_ADCSYSCFG0_AN8_Msk & ((value) << ADCHS_ADCSYSCFG0_AN8_Pos))
#define ADCHS_ADCSYSCFG0_AN9_Pos              _U_(9)                                               /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN9_Msk              (_U_(0x1) << ADCHS_ADCSYSCFG0_AN9_Pos)               /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN9(value)           (ADCHS_ADCSYSCFG0_AN9_Msk & ((value) << ADCHS_ADCSYSCFG0_AN9_Pos))
#define ADCHS_ADCSYSCFG0_AN10_Pos             _U_(10)                                              /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN10_Msk             (_U_(0x1) << ADCHS_ADCSYSCFG0_AN10_Pos)              /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN10(value)          (ADCHS_ADCSYSCFG0_AN10_Msk & ((value) << ADCHS_ADCSYSCFG0_AN10_Pos))
#define ADCHS_ADCSYSCFG0_AN11_Pos             _U_(11)                                              /**< (ADCHS_ADCSYSCFG0)  Position */
#define ADCHS_ADCSYSCFG0_AN11_Msk             (_U_(0x1) << ADCHS_ADCSYSCFG0_AN11_Pos)              /**< (ADCHS_ADCSYSCFG0)  Mask */
#define ADCHS_ADCSYSCFG0_AN11(value)          (ADCHS_ADCSYSCFG0_AN11_Msk & ((value) << ADCHS_ADCSYSCFG0_AN11_Pos))
#define ADCHS_ADCSYSCFG0_Msk                  _U_(0x00000FFF)                                      /**< (ADCHS_ADCSYSCFG0) Register Mask  */

#define ADCHS_ADCSYSCFG0_AN_Pos               _U_(0)                                               /**< (ADCHS_ADCSYSCFG0 Position)  */
#define ADCHS_ADCSYSCFG0_AN_Msk               (_U_(0xFFF) << ADCHS_ADCSYSCFG0_AN_Pos)              /**< (ADCHS_ADCSYSCFG0 Mask) AN */
#define ADCHS_ADCSYSCFG0_AN(value)            (ADCHS_ADCSYSCFG0_AN_Msk & ((value) << ADCHS_ADCSYSCFG0_AN_Pos)) 

/* -------- ADCHS_ADCDATA0 : (ADCHS Offset: 0xA00) (R/W 32)  -------- */
#define ADCHS_ADCDATA0_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA0)   Reset Value */

#define ADCHS_ADCDATA0_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA0)  Position */
#define ADCHS_ADCDATA0_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA0_DATA_Pos)         /**< (ADCHS_ADCDATA0)  Mask */
#define ADCHS_ADCDATA0_DATA(value)            (ADCHS_ADCDATA0_DATA_Msk & ((value) << ADCHS_ADCDATA0_DATA_Pos))
#define ADCHS_ADCDATA0_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA0) Register Mask  */


/* -------- ADCHS_ADCDATA1 : (ADCHS Offset: 0xA10) (R/W 32)  -------- */
#define ADCHS_ADCDATA1_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA1)   Reset Value */

#define ADCHS_ADCDATA1_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA1)  Position */
#define ADCHS_ADCDATA1_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA1_DATA_Pos)         /**< (ADCHS_ADCDATA1)  Mask */
#define ADCHS_ADCDATA1_DATA(value)            (ADCHS_ADCDATA1_DATA_Msk & ((value) << ADCHS_ADCDATA1_DATA_Pos))
#define ADCHS_ADCDATA1_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA1) Register Mask  */


/* -------- ADCHS_ADCDATA2 : (ADCHS Offset: 0xA20) (R/W 32)  -------- */
#define ADCHS_ADCDATA2_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA2)   Reset Value */

#define ADCHS_ADCDATA2_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA2)  Position */
#define ADCHS_ADCDATA2_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA2_DATA_Pos)         /**< (ADCHS_ADCDATA2)  Mask */
#define ADCHS_ADCDATA2_DATA(value)            (ADCHS_ADCDATA2_DATA_Msk & ((value) << ADCHS_ADCDATA2_DATA_Pos))
#define ADCHS_ADCDATA2_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA2) Register Mask  */


/* -------- ADCHS_ADCDATA3 : (ADCHS Offset: 0xA30) (R/W 32)  -------- */
#define ADCHS_ADCDATA3_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA3)   Reset Value */

#define ADCHS_ADCDATA3_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA3)  Position */
#define ADCHS_ADCDATA3_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA3_DATA_Pos)         /**< (ADCHS_ADCDATA3)  Mask */
#define ADCHS_ADCDATA3_DATA(value)            (ADCHS_ADCDATA3_DATA_Msk & ((value) << ADCHS_ADCDATA3_DATA_Pos))
#define ADCHS_ADCDATA3_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA3) Register Mask  */


/* -------- ADCHS_ADCDATA4 : (ADCHS Offset: 0xA40) (R/W 32)  -------- */
#define ADCHS_ADCDATA4_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA4)   Reset Value */

#define ADCHS_ADCDATA4_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA4)  Position */
#define ADCHS_ADCDATA4_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA4_DATA_Pos)         /**< (ADCHS_ADCDATA4)  Mask */
#define ADCHS_ADCDATA4_DATA(value)            (ADCHS_ADCDATA4_DATA_Msk & ((value) << ADCHS_ADCDATA4_DATA_Pos))
#define ADCHS_ADCDATA4_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA4) Register Mask  */


