Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCDATA5 : (ADCHS Offset: 0xA50) (R/W 32)  -------- */
#define ADCHS_ADCDATA5_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA5)   Reset Value */

#define ADCHS_ADCDATA5_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA5)  Position */
#define ADCHS_ADCDATA5_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA5_DATA_Pos)         /**< (ADCHS_ADCDATA5)  Mask */
#define ADCHS_ADCDATA5_DATA(value)            (ADCHS_ADCDATA5_DATA_Msk & ((value) << ADCHS_ADCDATA5_DATA_Pos))
#define ADCHS_ADCDATA5_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA5) Register Mask  */


/* -------- ADCHS_ADCDATA6 : (ADCHS Offset: 0xA60) (R/W 32)  -------- */
#define ADCHS_ADCDATA6_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA6)   Reset Value */

#define ADCHS_ADCDATA6_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA6)  Position */
#define ADCHS_ADCDATA6_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA6_DATA_Pos)         /**< (ADCHS_ADCDATA6)  Mask */
#define ADCHS_ADCDATA6_DATA(value)            (ADCHS_ADCDATA6_DATA_Msk & ((value) << ADCHS_ADCDATA6_DATA_Pos))
#define ADCHS_ADCDATA6_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA6) Register Mask  */


/* -------- ADCHS_ADCDATA7 : (ADCHS Offset: 0xA70) (R/W 32)  -------- */
#define ADCHS_ADCDATA7_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA7)   Reset Value */

#define ADCHS_ADCDATA7_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA7)  Position */
#define ADCHS_ADCDATA7_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA7_DATA_Pos)         /**< (ADCHS_ADCDATA7)  Mask */
#define ADCHS_ADCDATA7_DATA(value)            (ADCHS_ADCDATA7_DATA_Msk & ((value) << ADCHS_ADCDATA7_DATA_Pos))
#define ADCHS_ADCDATA7_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA7) Register Mask  */


/* -------- ADCHS_ADCDATA8 : (ADCHS Offset: 0xA80) (R/W 32)  -------- */
#define ADCHS_ADCDATA8_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA8)   Reset Value */

#define ADCHS_ADCDATA8_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA8)  Position */
#define ADCHS_ADCDATA8_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA8_DATA_Pos)         /**< (ADCHS_ADCDATA8)  Mask */
#define ADCHS_ADCDATA8_DATA(value)            (ADCHS_ADCDATA8_DATA_Msk & ((value) << ADCHS_ADCDATA8_DATA_Pos))
#define ADCHS_ADCDATA8_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA8) Register Mask  */


/* -------- ADCHS_ADCDATA9 : (ADCHS Offset: 0xA90) (R/W 32)  -------- */
#define ADCHS_ADCDATA9_RESETVALUE             _U_(0x00)                                            /**<  (ADCHS_ADCDATA9)   Reset Value */

#define ADCHS_ADCDATA9_DATA_Pos               _U_(0)                                               /**< (ADCHS_ADCDATA9)  Position */
#define ADCHS_ADCDATA9_DATA_Msk               (_U_(0xFFFFFFFF) << ADCHS_ADCDATA9_DATA_Pos)         /**< (ADCHS_ADCDATA9)  Mask */
#define ADCHS_ADCDATA9_DATA(value)            (ADCHS_ADCDATA9_DATA_Msk & ((value) << ADCHS_ADCDATA9_DATA_Pos))
#define ADCHS_ADCDATA9_Msk                    _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA9) Register Mask  */


/* -------- ADCHS_ADCDATA10 : (ADCHS Offset: 0xAA0) (R/W 32)  -------- */
#define ADCHS_ADCDATA10_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADCDATA10)   Reset Value */

#define ADCHS_ADCDATA10_DATA_Pos              _U_(0)                                               /**< (ADCHS_ADCDATA10)  Position */
#define ADCHS_ADCDATA10_DATA_Msk              (_U_(0xFFFFFFFF) << ADCHS_ADCDATA10_DATA_Pos)        /**< (ADCHS_ADCDATA10)  Mask */
#define ADCHS_ADCDATA10_DATA(value)           (ADCHS_ADCDATA10_DATA_Msk & ((value) << ADCHS_ADCDATA10_DATA_Pos))
#define ADCHS_ADCDATA10_Msk                   _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA10) Register Mask  */


/* -------- ADCHS_ADCDATA11 : (ADCHS Offset: 0xAB0) (R/W 32)  -------- */
#define ADCHS_ADCDATA11_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADCDATA11)   Reset Value */

#define ADCHS_ADCDATA11_DATA_Pos              _U_(0)                                               /**< (ADCHS_ADCDATA11)  Position */
#define ADCHS_ADCDATA11_DATA_Msk              (_U_(0xFFFFFFFF) << ADCHS_ADCDATA11_DATA_Pos)        /**< (ADCHS_ADCDATA11)  Mask */
#define ADCHS_ADCDATA11_DATA(value)           (ADCHS_ADCDATA11_DATA_Msk & ((value) << ADCHS_ADCDATA11_DATA_Pos))
#define ADCHS_ADCDATA11_Msk                   _U_(0xFFFFFFFF)                                      /**< (ADCHS_ADCDATA11) Register Mask  */


/* -------- ADCHS_ADCCON1CLR : (ADCHS Offset: 0x04) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCON1CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCON1CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON1CLR) Register Mask  */


/* -------- ADCHS_ADCCON1SET : (ADCHS Offset: 0x08) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCON1SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON1SET) Bit set register  Reset Value */

#define ADCHS_ADCCON1SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON1SET) Register Mask  */


/* -------- ADCHS_ADCCON1INV : (ADCHS Offset: 0x0C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCON1INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCON1INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON1INV) Register Mask  */


/* -------- ADCHS_ADCCON2CLR : (ADCHS Offset: 0x14) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCON2CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON2CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCON2CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON2CLR) Register Mask  */


