Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCCON2SET : (ADCHS Offset: 0x18) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCON2SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON2SET) Bit set register  Reset Value */

#define ADCHS_ADCCON2SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON2SET) Register Mask  */


/* -------- ADCHS_ADCCON2INV : (ADCHS Offset: 0x1C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCON2INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON2INV) Bit invert register  Reset Value */

#define ADCHS_ADCCON2INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON2INV) Register Mask  */


/* -------- ADCHS_ADCCON3CLR : (ADCHS Offset: 0x24) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCON3CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON3CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCON3CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON3CLR) Register Mask  */


/* -------- ADCHS_ADCCON3SET : (ADCHS Offset: 0x28) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCON3SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON3SET) Bit set register  Reset Value */

#define ADCHS_ADCCON3SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON3SET) Register Mask  */


/* -------- ADCHS_ADCCON3INV : (ADCHS Offset: 0x2C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCON3INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCON3INV) Bit invert register  Reset Value */

#define ADCHS_ADCCON3INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCON3INV) Register Mask  */


/* -------- ADCHS_ADCIMOD1CLR : (ADCHS Offset: 0x44) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCIMOD1CLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCIMOD1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCIMOD1CLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCIMOD1CLR) Register Mask  */


/* -------- ADCHS_ADCIMOD1SET : (ADCHS Offset: 0x48) (R/W 32) Bit set register -------- */
#define ADCHS_ADCIMOD1SET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCIMOD1SET) Bit set register  Reset Value */

#define ADCHS_ADCIMOD1SET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCIMOD1SET) Register Mask  */


/* -------- ADCHS_ADCIMOD1INV : (ADCHS Offset: 0x4C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCIMOD1INV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCIMOD1INV) Bit invert register  Reset Value */

#define ADCHS_ADCIMOD1INV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCIMOD1INV) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1CLR : (ADCHS Offset: 0x84) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCGIRQEN1CLR_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCGIRQEN1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCGIRQEN1CLR_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCGIRQEN1CLR) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1SET : (ADCHS Offset: 0x88) (R/W 32) Bit set register -------- */
#define ADCHS_ADCGIRQEN1SET_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCGIRQEN1SET) Bit set register  Reset Value */

#define ADCHS_ADCGIRQEN1SET_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCGIRQEN1SET) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1INV : (ADCHS Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCGIRQEN1INV_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCGIRQEN1INV) Bit invert register  Reset Value */

#define ADCHS_ADCGIRQEN1INV_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCGIRQEN1INV) Register Mask  */


/* -------- ADCHS_ADCCSS1CLR : (ADCHS Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCSS1CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCSS1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCSS1CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCSS1CLR) Register Mask  */


/* -------- ADCHS_ADCCSS1SET : (ADCHS Offset: 0xA8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCSS1SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCSS1SET) Bit set register  Reset Value */

#define ADCHS_ADCCSS1SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCSS1SET) Register Mask  */


/* -------- ADCHS_ADCCSS1INV : (ADCHS Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCSS1INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCSS1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCSS1INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCSS1INV) Register Mask  */


/* -------- ADCHS_ADCDSTAT1CLR : (ADCHS Offset: 0xC4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDSTAT1CLR_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCDSTAT1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCDSTAT1CLR_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCDSTAT1CLR) Register Mask  */


/* -------- ADCHS_ADCDSTAT1SET : (ADCHS Offset: 0xC8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDSTAT1SET_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCDSTAT1SET) Bit set register  Reset Value */

#define ADCHS_ADCDSTAT1SET_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCDSTAT1SET) Register Mask  */


/* -------- ADCHS_ADCDSTAT1INV : (ADCHS Offset: 0xCC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDSTAT1INV_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCDSTAT1INV) Bit invert register  Reset Value */

#define ADCHS_ADCDSTAT1INV_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCDSTAT1INV) Register Mask  */


