Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCCMPEN0CLR : (ADCHS Offset: 0xE4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPEN0CLR_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPEN0CLR_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCCMPEN0CLR) Register Mask  */


/* -------- ADCHS_ADCCMPEN0SET : (ADCHS Offset: 0xE8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPEN0SET_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN0SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPEN0SET_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCCMPEN0SET) Register Mask  */


/* -------- ADCHS_ADCCMPEN0INV : (ADCHS Offset: 0xEC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPEN0INV_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN0INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPEN0INV_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCCMPEN0INV) Register Mask  */


/* -------- ADCHS_ADCCMP0CLR : (ADCHS Offset: 0xF4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMP0CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCMP0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMP0CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCMP0CLR) Register Mask  */


/* -------- ADCHS_ADCCMP0SET : (ADCHS Offset: 0xF8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMP0SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCMP0SET) Bit set register  Reset Value */

#define ADCHS_ADCCMP0SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCMP0SET) Register Mask  */


/* -------- ADCHS_ADCCMP0INV : (ADCHS Offset: 0xFC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMP0INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCMP0INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMP0INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCMP0INV) Register Mask  */


/* -------- ADCHS_ADCCMPEN1CLR : (ADCHS Offset: 0x104) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPEN1CLR_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPEN1CLR_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCCMPEN1CLR) Register Mask  */


/* -------- ADCHS_ADCCMPEN1SET : (ADCHS Offset: 0x108) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPEN1SET_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN1SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPEN1SET_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCCMPEN1SET) Register Mask  */


/* -------- ADCHS_ADCCMPEN1INV : (ADCHS Offset: 0x10C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPEN1INV_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCCMPEN1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPEN1INV_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCCMPEN1INV) Register Mask  */


/* -------- ADCHS_ADDCMP1CLR : (ADCHS Offset: 0x114) (R/W 32) Bit clear register -------- */
#define ADCHS_ADDCMP1CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADDCMP1CLR) Bit clear register  Reset Value */

#define ADCHS_ADDCMP1CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADDCMP1CLR) Register Mask  */


/* -------- ADCHS_ADDCMP1SET : (ADCHS Offset: 0x118) (R/W 32) Bit set register -------- */
#define ADCHS_ADDCMP1SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADDCMP1SET) Bit set register  Reset Value */

#define ADCHS_ADDCMP1SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADDCMP1SET) Register Mask  */


/* -------- ADCHS_ADDCMP1INV : (ADCHS Offset: 0x11C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADDCMP1INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADDCMP1INV) Bit invert register  Reset Value */

#define ADCHS_ADDCMP1INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADDCMP1INV) Register Mask  */


/* -------- ADCHS_ADCFLTR0CLR : (ADCHS Offset: 0x1A4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFLTR0CLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFLTR0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCFLTR0CLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFLTR0CLR) Register Mask  */


/* -------- ADCHS_ADCFLTR0SET : (ADCHS Offset: 0x1A8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFLTR0SET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFLTR0SET) Bit set register  Reset Value */

#define ADCHS_ADCFLTR0SET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFLTR0SET) Register Mask  */


/* -------- ADCHS_ADCFLTR0INV : (ADCHS Offset: 0x1AC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFLTR0INV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFLTR0INV) Bit invert register  Reset Value */

#define ADCHS_ADCFLTR0INV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFLTR0INV) Register Mask  */


/* -------- ADCHS_ADCFLTR1CLR : (ADCHS Offset: 0x1B4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFLTR1CLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFLTR1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCFLTR1CLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFLTR1CLR) Register Mask  */


/* -------- ADCHS_ADCFLTR1SET : (ADCHS Offset: 0x1B8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFLTR1SET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFLTR1SET) Bit set register  Reset Value */

#define ADCHS_ADCFLTR1SET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFLTR1SET) Register Mask  */


