Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCFLTR1INV : (ADCHS Offset: 0x1BC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFLTR1INV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFLTR1INV) Bit invert register  Reset Value */

#define ADCHS_ADCFLTR1INV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFLTR1INV) Register Mask  */


/* -------- ADCHS_ADCTRG1CLR : (ADCHS Offset: 0x204) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCTRG1CLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCTRG1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCTRG1CLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCTRG1CLR) Register Mask  */


/* -------- ADCHS_ADCTRG1SET : (ADCHS Offset: 0x208) (R/W 32) Bit set register -------- */
#define ADCHS_ADCTRG1SET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCTRG1SET) Bit set register  Reset Value */

#define ADCHS_ADCTRG1SET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCTRG1SET) Register Mask  */


/* -------- ADCHS_ADCTRG1INV : (ADCHS Offset: 0x20C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCTRG1INV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCTRG1INV) Bit invert register  Reset Value */

#define ADCHS_ADCTRG1INV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCTRG1INV) Register Mask  */


/* -------- ADCHS_ADTRG2CLR : (ADCHS Offset: 0x214) (R/W 32) Bit clear register -------- */
#define ADCHS_ADTRG2CLR_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADTRG2CLR) Bit clear register  Reset Value */

#define ADCHS_ADTRG2CLR_Msk                   _U_(0x00000000)                                      /**< (ADCHS_ADTRG2CLR) Register Mask  */


/* -------- ADCHS_ADTRG2SET : (ADCHS Offset: 0x218) (R/W 32) Bit set register -------- */
#define ADCHS_ADTRG2SET_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADTRG2SET) Bit set register  Reset Value */

#define ADCHS_ADTRG2SET_Msk                   _U_(0x00000000)                                      /**< (ADCHS_ADTRG2SET) Register Mask  */


/* -------- ADCHS_ADTRG2INV : (ADCHS Offset: 0x21C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADTRG2INV_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADTRG2INV) Bit invert register  Reset Value */

#define ADCHS_ADTRG2INV_Msk                   _U_(0x00000000)                                      /**< (ADCHS_ADTRG2INV) Register Mask  */


/* -------- ADCHS_ADTRG3CLR : (ADCHS Offset: 0x224) (R/W 32) Bit clear register -------- */
#define ADCHS_ADTRG3CLR_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADTRG3CLR) Bit clear register  Reset Value */

#define ADCHS_ADTRG3CLR_Msk                   _U_(0x00000000)                                      /**< (ADCHS_ADTRG3CLR) Register Mask  */


/* -------- ADCHS_ADTRG3SET : (ADCHS Offset: 0x228) (R/W 32) Bit set register -------- */
#define ADCHS_ADTRG3SET_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADTRG3SET) Bit set register  Reset Value */

#define ADCHS_ADTRG3SET_Msk                   _U_(0x00000000)                                      /**< (ADCHS_ADTRG3SET) Register Mask  */


/* -------- ADCHS_ADTRG3INV : (ADCHS Offset: 0x22C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADTRG3INV_RESETVALUE            _U_(0x00)                                            /**<  (ADCHS_ADTRG3INV) Bit invert register  Reset Value */

#define ADCHS_ADTRG3INV_Msk                   _U_(0x00000000)                                      /**< (ADCHS_ADTRG3INV) Register Mask  */


/* -------- ADCHS_ADCCMPCON1CLR : (ADCHS Offset: 0x284) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPCON1CLR_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCCMPCON1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPCON1CLR_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCCMPCON1CLR) Register Mask  */


/* -------- ADCHS_ADCCMPCON1SET : (ADCHS Offset: 0x288) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPCON1SET_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCCMPCON1SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPCON1SET_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCCMPCON1SET) Register Mask  */


/* -------- ADCHS_ADCCMPCON1INV : (ADCHS Offset: 0x28C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPCON1INV_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCCMPCON1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPCON1INV_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCCMPCON1INV) Register Mask  */


/* -------- ADCHS_ADCMPCON2CLR : (ADCHS Offset: 0x294) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCMPCON2CLR_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCMPCON2CLR) Bit clear register  Reset Value */

#define ADCHS_ADCMPCON2CLR_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCMPCON2CLR) Register Mask  */


/* -------- ADCHS_ADCMPCON2SET : (ADCHS Offset: 0x298) (R/W 32) Bit set register -------- */
#define ADCHS_ADCMPCON2SET_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCMPCON2SET) Bit set register  Reset Value */

#define ADCHS_ADCMPCON2SET_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCMPCON2SET) Register Mask  */


/* -------- ADCHS_ADCMPCON2INV : (ADCHS Offset: 0x29C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCMPCON2INV_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCMPCON2INV) Bit invert register  Reset Value */

