Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
#define ADCHS_ADCMPCON2INV_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCMPCON2INV) Register Mask  */


/* -------- ADCHS_ADCFSTATCLR : (ADCHS Offset: 0x2E4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFSTATCLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFSTATCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFSTATCLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFSTATCLR) Register Mask  */


/* -------- ADCHS_ADCFSTATSET : (ADCHS Offset: 0x2E8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFSTATSET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFSTATSET) Bit set register  Reset Value */

#define ADCHS_ADCFSTATSET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFSTATSET) Register Mask  */


/* -------- ADCHS_ADCFSTATINV : (ADCHS Offset: 0x2EC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFSTATINV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFSTATINV) Bit invert register  Reset Value */

#define ADCHS_ADCFSTATINV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFSTATINV) Register Mask  */


/* -------- ADCHS_ADCFIFOCLR : (ADCHS Offset: 0x2F4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFIFOCLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCFIFOCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFIFOCLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCFIFOCLR) Register Mask  */


/* -------- ADCHS_ADCFIFOSET : (ADCHS Offset: 0x2F8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFIFOSET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCFIFOSET) Bit set register  Reset Value */

#define ADCHS_ADCFIFOSET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCFIFOSET) Register Mask  */


/* -------- ADCHS_ADCFIFOINV : (ADCHS Offset: 0x2FC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFIFOINV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCFIFOINV) Bit invert register  Reset Value */

#define ADCHS_ADCFIFOINV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCFIFOINV) Register Mask  */


/* -------- ADCHS_ADCBASECLR : (ADCHS Offset: 0x304) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCBASECLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCBASECLR) Bit clear register  Reset Value */

#define ADCHS_ADCBASECLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCBASECLR) Register Mask  */


/* -------- ADCHS_ADCBASESET : (ADCHS Offset: 0x308) (R/W 32) Bit set register -------- */
#define ADCHS_ADCBASESET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCBASESET) Bit set register  Reset Value */

#define ADCHS_ADCBASESET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCBASESET) Register Mask  */


/* -------- ADCHS_ADCBASEINV : (ADCHS Offset: 0x30C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCBASEINV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCBASEINV) Bit invert register  Reset Value */

#define ADCHS_ADCBASEINV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCBASEINV) Register Mask  */


/* -------- ADCHS_ADCDMASTATCLR : (ADCHS Offset: 0x314) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDMASTATCLR_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCDMASTATCLR) Bit clear register  Reset Value */

#define ADCHS_ADCDMASTATCLR_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCDMASTATCLR) Register Mask  */


/* -------- ADCHS_ADCDMASTATSET : (ADCHS Offset: 0x318) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDMASTATSET_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCDMASTATSET) Bit set register  Reset Value */

#define ADCHS_ADCDMASTATSET_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCDMASTATSET) Register Mask  */


/* -------- ADCHS_ADCDMASTATINV : (ADCHS Offset: 0x31C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDMASTATINV_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCDMASTATINV) Bit invert register  Reset Value */

#define ADCHS_ADCDMASTATINV_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCDMASTATINV) Register Mask  */


/* -------- ADCHS_ADCCNTBCLR : (ADCHS Offset: 0x324) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCNTBCLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCNTBCLR) Bit clear register  Reset Value */

#define ADCHS_ADCCNTBCLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCNTBCLR) Register Mask  */


/* -------- ADCHS_ADCCNTBSET : (ADCHS Offset: 0x328) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCNTBSET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCNTBSET) Bit set register  Reset Value */

#define ADCHS_ADCCNTBSET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCNTBSET) Register Mask  */


/* -------- ADCHS_ADCCNTBINV : (ADCHS Offset: 0x32C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCNTBINV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCCNTBINV) Bit invert register  Reset Value */

#define ADCHS_ADCCNTBINV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCCNTBINV) Register Mask  */


/* -------- ADCHS_ADCDMABCLR : (ADCHS Offset: 0x334) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDMABCLR_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCDMABCLR) Bit clear register  Reset Value */

#define ADCHS_ADCDMABCLR_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCDMABCLR) Register Mask  */


/* -------- ADCHS_ADCDMABSET : (ADCHS Offset: 0x338) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDMABSET_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCDMABSET) Bit set register  Reset Value */

#define ADCHS_ADCDMABSET_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCDMABSET) Register Mask  */


/* -------- ADCHS_ADCDMABINV : (ADCHS Offset: 0x33C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDMABINV_RESETVALUE           _U_(0x00)                                            /**<  (ADCHS_ADCDMABINV) Bit invert register  Reset Value */

#define ADCHS_ADCDMABINV_Msk                  _U_(0x00000000)                                      /**< (ADCHS_ADCDMABINV) Register Mask  */


