Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCTRGSNSCLR : (ADCHS Offset: 0x344) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCTRGSNSCLR_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCTRGSNSCLR) Bit clear register  Reset Value */

#define ADCHS_ADCTRGSNSCLR_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCTRGSNSCLR) Register Mask  */


/* -------- ADCHS_ADCTRGSNSSET : (ADCHS Offset: 0x348) (R/W 32) Bit set register -------- */
#define ADCHS_ADCTRGSNSSET_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCTRGSNSSET) Bit set register  Reset Value */

#define ADCHS_ADCTRGSNSSET_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCTRGSNSSET) Register Mask  */


/* -------- ADCHS_ADCTRGSNSINV : (ADCHS Offset: 0x34C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCTRGSNSINV_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCTRGSNSINV) Bit invert register  Reset Value */

#define ADCHS_ADCTRGSNSINV_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCTRGSNSINV) Register Mask  */


/* -------- ADCHS_ADC0TIMECLR : (ADCHS Offset: 0x354) (R/W 32) Bit clear register -------- */
#define ADCHS_ADC0TIMECLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADC0TIMECLR) Bit clear register  Reset Value */

#define ADCHS_ADC0TIMECLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADC0TIMECLR) Register Mask  */


/* -------- ADCHS_ADC0TIMESET : (ADCHS Offset: 0x358) (R/W 32) Bit set register -------- */
#define ADCHS_ADC0TIMESET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADC0TIMESET) Bit set register  Reset Value */

#define ADCHS_ADC0TIMESET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADC0TIMESET) Register Mask  */


/* -------- ADCHS_ADC0TIMEINV : (ADCHS Offset: 0x35C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADC0TIMEINV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADC0TIMEINV) Bit invert register  Reset Value */

#define ADCHS_ADC0TIMEINV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADC0TIMEINV) Register Mask  */


/* -------- ADCHS_ADCEISTAT1CLR : (ADCHS Offset: 0x3E4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCEISTAT1CLR_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCEISTAT1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCEISTAT1CLR_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCEISTAT1CLR) Register Mask  */


/* -------- ADCHS_ADCEISTAT1SET : (ADCHS Offset: 0x3E8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCEISTAT1SET_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCEISTAT1SET) Bit set register  Reset Value */

#define ADCHS_ADCEISTAT1SET_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCEISTAT1SET) Register Mask  */


/* -------- ADCHS_ADCEISTAT1INV : (ADCHS Offset: 0x3EC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCEISTAT1INV_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCEISTAT1INV) Bit invert register  Reset Value */

#define ADCHS_ADCEISTAT1INV_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCEISTAT1INV) Register Mask  */


/* -------- ADCHS_ADCANLCTLCLR : (ADCHS Offset: 0x404) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCANLCTLCLR_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCANLCTLCLR) Bit clear register  Reset Value */

#define ADCHS_ADCANLCTLCLR_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCANLCTLCLR) Register Mask  */


/* -------- ADCHS_ADCANLCTLSET : (ADCHS Offset: 0x408) (R/W 32) Bit set register -------- */
#define ADCHS_ADCANLCTLSET_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCANLCTLSET) Bit set register  Reset Value */

#define ADCHS_ADCANLCTLSET_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCANLCTLSET) Register Mask  */


/* -------- ADCHS_ADCANLCTLINV : (ADCHS Offset: 0x40C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCANLCTLINV_RESETVALUE         _U_(0x00)                                            /**<  (ADCHS_ADCANLCTLINV) Bit invert register  Reset Value */

#define ADCHS_ADCANLCTLINV_Msk                _U_(0x00000000)                                      /**< (ADCHS_ADCANLCTLINV) Register Mask  */


/* -------- ADCHS_ADCFGSHRCLR : (ADCHS Offset: 0x674) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFGSHRCLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFGSHRCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFGSHRCLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFGSHRCLR) Register Mask  */


/* -------- ADCHS_ADCFGSHRSET : (ADCHS Offset: 0x678) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFGSHRSET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFGSHRSET) Bit set register  Reset Value */

#define ADCHS_ADCFGSHRSET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFGSHRSET) Register Mask  */


/* -------- ADCHS_ADCFGSHRINV : (ADCHS Offset: 0x67C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFGSHRINV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCFGSHRINV) Bit invert register  Reset Value */

#define ADCHS_ADCFGSHRINV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCFGSHRINV) Register Mask  */


