Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.80/WBZ450/include/component/adchs.h
/* -------- ADCHS_ADCSVCONCLR : (ADCHS Offset: 0x684) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCSVCONCLR_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCSVCONCLR) Bit clear register  Reset Value */

#define ADCHS_ADCSVCONCLR_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCSVCONCLR) Register Mask  */


/* -------- ADCHS_ADCSVCONSET : (ADCHS Offset: 0x688) (R/W 32) Bit set register -------- */
#define ADCHS_ADCSVCONSET_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCSVCONSET) Bit set register  Reset Value */

#define ADCHS_ADCSVCONSET_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCSVCONSET) Register Mask  */


/* -------- ADCHS_ADCSVCONINV : (ADCHS Offset: 0x68C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCSVCONINV_RESETVALUE          _U_(0x00)                                            /**<  (ADCHS_ADCSVCONINV) Bit invert register  Reset Value */

#define ADCHS_ADCSVCONINV_Msk                 _U_(0x00000000)                                      /**< (ADCHS_ADCSVCONINV) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0CLR : (ADCHS Offset: 0x704) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCSYSCFG0CLR_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCSYSCFG0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCSYSCFG0CLR_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCSYSCFG0CLR) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0SET : (ADCHS Offset: 0x708) (R/W 32) Bit set register -------- */
#define ADCHS_ADCSYSCFG0SET_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCSYSCFG0SET) Bit set register  Reset Value */

#define ADCHS_ADCSYSCFG0SET_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCSYSCFG0SET) Register Mask  */


/* -------- ADCHS_ADCSYSCFG0INV : (ADCHS Offset: 0x70C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCSYSCFG0INV_RESETVALUE        _U_(0x00)                                            /**<  (ADCHS_ADCSYSCFG0INV) Bit invert register  Reset Value */

#define ADCHS_ADCSYSCFG0INV_Msk               _U_(0x00000000)                                      /**< (ADCHS_ADCSYSCFG0INV) Register Mask  */


/** \brief ADCHS register offsets definitions */
#define ADCHS_ADCCON1_REG_OFST         (0x00)              /**< (ADCHS_ADCCON1)  Offset */
#define ADCHS_ADCCON2_REG_OFST         (0x10)              /**< (ADCHS_ADCCON2)  Offset */
#define ADCHS_ADCCON3_REG_OFST         (0x20)              /**< (ADCHS_ADCCON3)  Offset */
#define ADCHS_ADCIMCON1_REG_OFST       (0x40)              /**< (ADCHS_ADCIMCON1)  Offset */
#define ADCHS_ADCGIRQEN1_REG_OFST      (0x80)              /**< (ADCHS_ADCGIRQEN1)  Offset */
#define ADCHS_ADCCSS1_REG_OFST         (0xA0)              /**< (ADCHS_ADCCSS1)  Offset */
#define ADCHS_ADCDSTAT1_REG_OFST       (0xC0)              /**< (ADCHS_ADCDSTAT1)  Offset */
#define ADCHS_ADCCMPEN1_REG_OFST       (0xE0)              /**< (ADCHS_ADCCMPEN1)  Offset */
#define ADCHS_ADCCMP1_REG_OFST         (0xF0)              /**< (ADCHS_ADCCMP1)  Offset */
#define ADCHS_ADCCMPEN2_REG_OFST       (0x100)             /**< (ADCHS_ADCCMPEN2)  Offset */
#define ADCHS_ADCCMP2_REG_OFST         (0x110)             /**< (ADCHS_ADCCMP2)  Offset */
#define ADCHS_ADCFLTR1_REG_OFST        (0x1A0)             /**< (ADCHS_ADCFLTR1)  Offset */
#define ADCHS_ADCFLTR2_REG_OFST        (0x1B0)             /**< (ADCHS_ADCFLTR2)  Offset */
#define ADCHS_ADCTRG1_REG_OFST         (0x200)             /**< (ADCHS_ADCTRG1) ADC Trigger Source 1 Register Offset */
#define ADCHS_ADCTRG2_REG_OFST         (0x210)             /**< (ADCHS_ADCTRG2) ADC Trigger Source 2 Register Offset */
#define ADCHS_ADCCMPCON1_REG_OFST      (0x280)             /**< (ADCHS_ADCCMPCON1)  Offset */
#define ADCHS_ADCCMPCON2_REG_OFST      (0x290)             /**< (ADCHS_ADCCMPCON2)  Offset */
#define ADCHS_ADCBASE_REG_OFST         (0x300)             /**< (ADCHS_ADCBASE)  Offset */
#define ADCHS_ADCDMASTAT_REG_OFST      (0x310)             /**< (ADCHS_ADCDMASTAT)  Offset */
#define ADCHS_ADCCNTB_REG_OFST         (0x320)             /**< (ADCHS_ADCCNTB)  Offset */
#define ADCHS_ADCDMAB_REG_OFST         (0x330)             /**< (ADCHS_ADCDMAB)  Offset */
#define ADCHS_ADCTRGSNS_REG_OFST       (0x340)             /**< (ADCHS_ADCTRGSNS)  Offset */
#define ADCHS_ADCANCON_REG_OFST        (0x400)             /**< (ADCHS_ADCANCON)  Offset */
#define ADCHS_ADC7CFG_REG_OFST         (0x670)             /**< (ADCHS_ADC7CFG)  Offset */
#define ADCHS_ADCSYSCFG0_REG_OFST      (0x700)             /**< (ADCHS_ADCSYSCFG0)  Offset */
#define ADCHS_ADCDATA0_REG_OFST        (0xA00)             /**< (ADCHS_ADCDATA0)  Offset */
#define ADCHS_ADCDATA1_REG_OFST        (0xA10)             /**< (ADCHS_ADCDATA1)  Offset */
#define ADCHS_ADCDATA2_REG_OFST        (0xA20)             /**< (ADCHS_ADCDATA2)  Offset */
#define ADCHS_ADCDATA3_REG_OFST        (0xA30)             /**< (ADCHS_ADCDATA3)  Offset */
#define ADCHS_ADCDATA4_REG_OFST        (0xA40)             /**< (ADCHS_ADCDATA4)  Offset */
#define ADCHS_ADCDATA5_REG_OFST        (0xA50)             /**< (ADCHS_ADCDATA5)  Offset */
#define ADCHS_ADCDATA6_REG_OFST        (0xA60)             /**< (ADCHS_ADCDATA6)  Offset */
#define ADCHS_ADCDATA7_REG_OFST        (0xA70)             /**< (ADCHS_ADCDATA7)  Offset */
#define ADCHS_ADCDATA8_REG_OFST        (0xA80)             /**< (ADCHS_ADCDATA8)  Offset */
#define ADCHS_ADCDATA9_REG_OFST        (0xA90)             /**< (ADCHS_ADCDATA9)  Offset */
#define ADCHS_ADCDATA10_REG_OFST       (0xAA0)             /**< (ADCHS_ADCDATA10)  Offset */
#define ADCHS_ADCDATA11_REG_OFST       (0xAB0)             /**< (ADCHS_ADCDATA11)  Offset */
#define ADCHS_ADCCON1CLR_REG_OFST      (0x04)              /**< (ADCHS_ADCCON1CLR) Bit clear register Offset */
#define ADCHS_ADCCON1SET_REG_OFST      (0x08)              /**< (ADCHS_ADCCON1SET) Bit set register Offset */
#define ADCHS_ADCCON1INV_REG_OFST      (0x0C)              /**< (ADCHS_ADCCON1INV) Bit invert register Offset */
#define ADCHS_ADCCON2CLR_REG_OFST      (0x14)              /**< (ADCHS_ADCCON2CLR) Bit clear register Offset */
#define ADCHS_ADCCON2SET_REG_OFST      (0x18)              /**< (ADCHS_ADCCON2SET) Bit set register Offset */
#define ADCHS_ADCCON2INV_REG_OFST      (0x1C)              /**< (ADCHS_ADCCON2INV) Bit invert register Offset */
#define ADCHS_ADCCON3CLR_REG_OFST      (0x24)              /**< (ADCHS_ADCCON3CLR) Bit clear register Offset */
#define ADCHS_ADCCON3SET_REG_OFST      (0x28)              /**< (ADCHS_ADCCON3SET) Bit set register Offset */
#define ADCHS_ADCCON3INV_REG_OFST      (0x2C)              /**< (ADCHS_ADCCON3INV) Bit invert register Offset */
#define ADCHS_ADCIMOD1CLR_REG_OFST     (0x44)              /**< (ADCHS_ADCIMOD1CLR) Bit clear register Offset */
#define ADCHS_ADCIMOD1SET_REG_OFST     (0x48)              /**< (ADCHS_ADCIMOD1SET) Bit set register Offset */
#define ADCHS_ADCIMOD1INV_REG_OFST     (0x4C)              /**< (ADCHS_ADCIMOD1INV) Bit invert register Offset */
#define ADCHS_ADCGIRQEN1CLR_REG_OFST   (0x84)              /**< (ADCHS_ADCGIRQEN1CLR) Bit clear register Offset */
#define ADCHS_ADCGIRQEN1SET_REG_OFST   (0x88)              /**< (ADCHS_ADCGIRQEN1SET) Bit set register Offset */
#define ADCHS_ADCGIRQEN1INV_REG_OFST   (0x8C)              /**< (ADCHS_ADCGIRQEN1INV) Bit invert register Offset */
#define ADCHS_ADCCSS1CLR_REG_OFST      (0xA4)              /**< (ADCHS_ADCCSS1CLR) Bit clear register Offset */
#define ADCHS_ADCCSS1SET_REG_OFST      (0xA8)              /**< (ADCHS_ADCCSS1SET) Bit set register Offset */
#define ADCHS_ADCCSS1INV_REG_OFST      (0xAC)              /**< (ADCHS_ADCCSS1INV) Bit invert register Offset */
#define ADCHS_ADCDSTAT1CLR_REG_OFST    (0xC4)              /**< (ADCHS_ADCDSTAT1CLR) Bit clear register Offset */
#define ADCHS_ADCDSTAT1SET_REG_OFST    (0xC8)              /**< (ADCHS_ADCDSTAT1SET) Bit set register Offset */
#define ADCHS_ADCDSTAT1INV_REG_OFST    (0xCC)              /**< (ADCHS_ADCDSTAT1INV) Bit invert register Offset */
#define ADCHS_ADCCMPEN0CLR_REG_OFST    (0xE4)              /**< (ADCHS_ADCCMPEN0CLR) Bit clear register Offset */
#define ADCHS_ADCCMPEN0SET_REG_OFST    (0xE8)              /**< (ADCHS_ADCCMPEN0SET) Bit set register Offset */
#define ADCHS_ADCCMPEN0INV_REG_OFST    (0xEC)              /**< (ADCHS_ADCCMPEN0INV) Bit invert register Offset */
#define ADCHS_ADCCMP0CLR_REG_OFST      (0xF4)              /**< (ADCHS_ADCCMP0CLR) Bit clear register Offset */
#define ADCHS_ADCCMP0SET_REG_OFST      (0xF8)              /**< (ADCHS_ADCCMP0SET) Bit set register Offset */
#define ADCHS_ADCCMP0INV_REG_OFST      (0xFC)              /**< (ADCHS_ADCCMP0INV) Bit invert register Offset */
#define ADCHS_ADCCMPEN1CLR_REG_OFST    (0x104)             /**< (ADCHS_ADCCMPEN1CLR) Bit clear register Offset */
#define ADCHS_ADCCMPEN1SET_REG_OFST    (0x108)             /**< (ADCHS_ADCCMPEN1SET) Bit set register Offset */
#define ADCHS_ADCCMPEN1INV_REG_OFST    (0x10C)             /**< (ADCHS_ADCCMPEN1INV) Bit invert register Offset */
#define ADCHS_ADDCMP1CLR_REG_OFST      (0x114)             /**< (ADCHS_ADDCMP1CLR) Bit clear register Offset */
#define ADCHS_ADDCMP1SET_REG_OFST      (0x118)             /**< (ADCHS_ADDCMP1SET) Bit set register Offset */
#define ADCHS_ADDCMP1INV_REG_OFST      (0x11C)             /**< (ADCHS_ADDCMP1INV) Bit invert register Offset */
#define ADCHS_ADCFLTR0CLR_REG_OFST     (0x1A4)             /**< (ADCHS_ADCFLTR0CLR) Bit clear register Offset */
#define ADCHS_ADCFLTR0SET_REG_OFST     (0x1A8)             /**< (ADCHS_ADCFLTR0SET) Bit set register Offset */
#define ADCHS_ADCFLTR0INV_REG_OFST     (0x1AC)             /**< (ADCHS_ADCFLTR0INV) Bit invert register Offset */
#define ADCHS_ADCFLTR1CLR_REG_OFST     (0x1B4)             /**< (ADCHS_ADCFLTR1CLR) Bit clear register Offset */
#define ADCHS_ADCFLTR1SET_REG_OFST     (0x1B8)             /**< (ADCHS_ADCFLTR1SET) Bit set register Offset */
#define ADCHS_ADCFLTR1INV_REG_OFST     (0x1BC)             /**< (ADCHS_ADCFLTR1INV) Bit invert register Offset */
#define ADCHS_ADCTRG1CLR_REG_OFST      (0x204)             /**< (ADCHS_ADCTRG1CLR) Bit clear register Offset */
#define ADCHS_ADCTRG1SET_REG_OFST      (0x208)             /**< (ADCHS_ADCTRG1SET) Bit set register Offset */
#define ADCHS_ADCTRG1INV_REG_OFST      (0x20C)             /**< (ADCHS_ADCTRG1INV) Bit invert register Offset */
#define ADCHS_ADTRG2CLR_REG_OFST       (0x214)             /**< (ADCHS_ADTRG2CLR) Bit clear register Offset */
#define ADCHS_ADTRG2SET_REG_OFST       (0x218)             /**< (ADCHS_ADTRG2SET) Bit set register Offset */
#define ADCHS_ADTRG2INV_REG_OFST       (0x21C)             /**< (ADCHS_ADTRG2INV) Bit invert register Offset */
#define ADCHS_ADTRG3CLR_REG_OFST       (0x224)             /**< (ADCHS_ADTRG3CLR) Bit clear register Offset */
#define ADCHS_ADTRG3SET_REG_OFST       (0x228)             /**< (ADCHS_ADTRG3SET) Bit set register Offset */
#define ADCHS_ADTRG3INV_REG_OFST       (0x22C)             /**< (ADCHS_ADTRG3INV) Bit invert register Offset */
#define ADCHS_ADCCMPCON1CLR_REG_OFST   (0x284)             /**< (ADCHS_ADCCMPCON1CLR) Bit clear register Offset */
#define ADCHS_ADCCMPCON1SET_REG_OFST   (0x288)             /**< (ADCHS_ADCCMPCON1SET) Bit set register Offset */
#define ADCHS_ADCCMPCON1INV_REG_OFST   (0x28C)             /**< (ADCHS_ADCCMPCON1INV) Bit invert register Offset */
#define ADCHS_ADCMPCON2CLR_REG_OFST    (0x294)             /**< (ADCHS_ADCMPCON2CLR) Bit clear register Offset */
#define ADCHS_ADCMPCON2SET_REG_OFST    (0x298)             /**< (ADCHS_ADCMPCON2SET) Bit set register Offset */
#define ADCHS_ADCMPCON2INV_REG_OFST    (0x29C)             /**< (ADCHS_ADCMPCON2INV) Bit invert register Offset */
#define ADCHS_ADCFSTATCLR_REG_OFST     (0x2E4)             /**< (ADCHS_ADCFSTATCLR) Bit clear register Offset */
#define ADCHS_ADCFSTATSET_REG_OFST     (0x2E8)             /**< (ADCHS_ADCFSTATSET) Bit set register Offset */
#define ADCHS_ADCFSTATINV_REG_OFST     (0x2EC)             /**< (ADCHS_ADCFSTATINV) Bit invert register Offset */
#define ADCHS_ADCFIFOCLR_REG_OFST      (0x2F4)             /**< (ADCHS_ADCFIFOCLR) Bit clear register Offset */
#define ADCHS_ADCFIFOSET_REG_OFST      (0x2F8)             /**< (ADCHS_ADCFIFOSET) Bit set register Offset */
#define ADCHS_ADCFIFOINV_REG_OFST      (0x2FC)             /**< (ADCHS_ADCFIFOINV) Bit invert register Offset */
#define ADCHS_ADCBASECLR_REG_OFST      (0x304)             /**< (ADCHS_ADCBASECLR) Bit clear register Offset */
#define ADCHS_ADCBASESET_REG_OFST      (0x308)             /**< (ADCHS_ADCBASESET) Bit set register Offset */
#define ADCHS_ADCBASEINV_REG_OFST      (0x30C)             /**< (ADCHS_ADCBASEINV) Bit invert register Offset */
#define ADCHS_ADCDMASTATCLR_REG_OFST   (0x314)             /**< (ADCHS_ADCDMASTATCLR) Bit clear register Offset */
#define ADCHS_ADCDMASTATSET_REG_OFST   (0x318)             /**< (ADCHS_ADCDMASTATSET) Bit set register Offset */
#define ADCHS_ADCDMASTATINV_REG_OFST   (0x31C)             /**< (ADCHS_ADCDMASTATINV) Bit invert register Offset */
#define ADCHS_ADCCNTBCLR_REG_OFST      (0x324)             /**< (ADCHS_ADCCNTBCLR) Bit clear register Offset */
#define ADCHS_ADCCNTBSET_REG_OFST      (0x328)             /**< (ADCHS_ADCCNTBSET) Bit set register Offset */
#define ADCHS_ADCCNTBINV_REG_OFST      (0x32C)             /**< (ADCHS_ADCCNTBINV) Bit invert register Offset */
#define ADCHS_ADCDMABCLR_REG_OFST      (0x334)             /**< (ADCHS_ADCDMABCLR) Bit clear register Offset */
#define ADCHS_ADCDMABSET_REG_OFST      (0x338)             /**< (ADCHS_ADCDMABSET) Bit set register Offset */
#define ADCHS_ADCDMABINV_REG_OFST      (0x33C)             /**< (ADCHS_ADCDMABINV) Bit invert register Offset */
#define ADCHS_ADCTRGSNSCLR_REG_OFST    (0x344)             /**< (ADCHS_ADCTRGSNSCLR) Bit clear register Offset */
#define ADCHS_ADCTRGSNSSET_REG_OFST    (0x348)             /**< (ADCHS_ADCTRGSNSSET) Bit set register Offset */
#define ADCHS_ADCTRGSNSINV_REG_OFST    (0x34C)             /**< (ADCHS_ADCTRGSNSINV) Bit invert register Offset */
#define ADCHS_ADC0TIMECLR_REG_OFST     (0x354)             /**< (ADCHS_ADC0TIMECLR) Bit clear register Offset */
#define ADCHS_ADC0TIMESET_REG_OFST     (0x358)             /**< (ADCHS_ADC0TIMESET) Bit set register Offset */
#define ADCHS_ADC0TIMEINV_REG_OFST     (0x35C)             /**< (ADCHS_ADC0TIMEINV) Bit invert register Offset */
#define ADCHS_ADCEISTAT1CLR_REG_OFST   (0x3E4)             /**< (ADCHS_ADCEISTAT1CLR) Bit clear register Offset */
#define ADCHS_ADCEISTAT1SET_REG_OFST   (0x3E8)             /**< (ADCHS_ADCEISTAT1SET) Bit set register Offset */
#define ADCHS_ADCEISTAT1INV_REG_OFST   (0x3EC)             /**< (ADCHS_ADCEISTAT1INV) Bit invert register Offset */
#define ADCHS_ADCANLCTLCLR_REG_OFST    (0x404)             /**< (ADCHS_ADCANLCTLCLR) Bit clear register Offset */
#define ADCHS_ADCANLCTLSET_REG_OFST    (0x408)             /**< (ADCHS_ADCANLCTLSET) Bit set register Offset */
#define ADCHS_ADCANLCTLINV_REG_OFST    (0x40C)             /**< (ADCHS_ADCANLCTLINV) Bit invert register Offset */
#define ADCHS_ADCFGSHRCLR_REG_OFST     (0x674)             /**< (ADCHS_ADCFGSHRCLR) Bit clear register Offset */
#define ADCHS_ADCFGSHRSET_REG_OFST     (0x678)             /**< (ADCHS_ADCFGSHRSET) Bit set register Offset */
#define ADCHS_ADCFGSHRINV_REG_OFST     (0x67C)             /**< (ADCHS_ADCFGSHRINV) Bit invert register Offset */
#define ADCHS_ADCSVCONCLR_REG_OFST     (0x684)             /**< (ADCHS_ADCSVCONCLR) Bit clear register Offset */
#define ADCHS_ADCSVCONSET_REG_OFST     (0x688)             /**< (ADCHS_ADCSVCONSET) Bit set register Offset */
#define ADCHS_ADCSVCONINV_REG_OFST     (0x68C)             /**< (ADCHS_ADCSVCONINV) Bit invert register Offset */
#define ADCHS_ADCSYSCFG0CLR_REG_OFST   (0x704)             /**< (ADCHS_ADCSYSCFG0CLR) Bit clear register Offset */
#define ADCHS_ADCSYSCFG0SET_REG_OFST   (0x708)             /**< (ADCHS_ADCSYSCFG0SET) Bit set register Offset */
#define ADCHS_ADCSYSCFG0INV_REG_OFST   (0x70C)             /**< (ADCHS_ADCSYSCFG0INV) Bit invert register Offset */

